{
  "activity_differential": [
    "young goat foraging and approaching adult goat",
    "goats foraging together in grassy field",
    "camera tracking young goat's movement"
  ],
  "description": "A young goat wearing a shirt is moving across a grassy area, gradually approaching an adult goat. The adult goat is stationary and appears to be grazing or foraging. The camera follows the young goat as it moves toward the adult goat, capturing their interactions.",
  "place_env_id_name": "grassy field",
  "relationship_filter_metadata": [
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be in front of a dense patch of foliage in a natural scene. The spatial relationship described is physically and semantically sound.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible and meaningful to state that the goat is to the right of the dirt, as 'right of' describes a standard spatial relationship between a moving animal and a static object like dirt.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "It is unlikely and implausible for a goat to be on top of a small, dense, bushy plant, especially given the described sizes and typical physical interactions between goats and plants in a grazing scenario.",
      "label": "physically_implausible",
      "object_id": 5,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be below a driftwood, especially if the driftwood is elevated (e.g., on rocks or above ground) or the goat is inspecting the ground. The relationship does not violate semantic or physical logic with the provided descriptions.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be spatially 'left of' an irregular stationary object; the relationship is both physically possible and semantically clear.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a goat to be left of a crumpled piece of paper in a scene; the relationship makes sense in the described context.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be left of a plastic bag in a scene. The spatial relationship described makes semantic and physical sense.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be spatially located to the left of a leaf in a scene description; the relationship is semantically and physically sensible.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a goat to be 'left of' a plastic bag in this spatial scene. No inversion is required.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a moving goat to be spatially 'left of' a small, stationary wooden object within a scene, and both are physically compatible with this spatial relationship.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a moving goat to be 'left of' a stationary towel on the ground. The relationship is clearly described, and there is no indication that flipping or dropping is necessary.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a goat to be below a rabbit, for example if the rabbit is perched on higher terrain or an object. Nothing in the metadata contradicts this configuration.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "It is highly unlikely for a goat to be spatially positioned below a piece of driftwood, especially based on typical physical interactions in natural scenes. Usually, driftwood lies on the ground and an animal might be above or near it, not below.",
      "label": "physically_implausible",
      "object_id": 15,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a goat to be spatially left of a rabbit in a scene, and nothing about the metadata or context makes this spatial relation implausible.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name or description, making it impossible to evaluate the spatial relationship 'below' involving the goat.",
      "label": "incomplete_object",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "Both the subject and object are goats, and it is spatially plausible for one goat to be 'right of' another in a scene. The relationship appears sensible given the spatial predicate.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be in front of foliage, especially in a natural outdoor setting. The spatial relationship accurately reflects a common scene structure.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a goat to be 'right of' a piece of paper in a scene. There is no semantic or physical contradiction, so the relationship is logical and should be kept.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a goat to be to the right of a plastic bag in a video scene. The relationship is clear and physically possible.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible and contextually reasonable for a goat to be described as to the right of a leaf within a scene. The relationship uses common spatial terminology and matches typical expectations, with no need to flip subject/object.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be 'right of' a small wooden object within a scene, as the relationship describes a possible spatial arrangement.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a goat to be physically below a rabbit in a scene, for example if the rabbit is on a raised surface or the goat is lower in the terrain. The 'below' spatial relationship is thus reasonable and does not violate physical or semantic expectations.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a cluster of foliage to be behind a goat in a natural scene, especially given the described context of both objects and their spatial arrangement.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for foliage to be behind a goat in a scene; the spatial predicate 'behind' makes sense for these objects.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a mound of dirt to be left of a goat within a scene, and the predicate 'left of' is appropriate for describing their relative positions.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a mound of dirt to be to the left of a piece of driftwood in a scene. The spatial relationship 'left of' is reasonable given the described objects and context.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a mound of dirt to be described as 'left of' a plastic bag, given the context and typical scene composition. The predicate and objects are semantically and physically compatible.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a mound of dirt to be spatially to the left of a piece of drifting wood, especially given the stationary nature of dirt and the possible movement of the driftwood.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'left of' between the dirt and an unspecified object is plausible, as long as the spatial arrangement holds in the scene. Although the object is unnamed, the relationship itself is reasonable.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a goat to be under a plant (e.g., grazing beneath foliage) than for a plant to be under a goat. Flipping the subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dense, bushy plant to be positioned to the right of a crumpled paper in a scene. The predicate 'right of' describes a valid spatial relationship.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plant to be right of a plastic bag in a scene, and the descriptions do not contradict this spatial relationship.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plant to be spatially located to the right of a leaf, especially if the leaf is identified separately in a scene. The given subject and object descriptions are consistent with this relationship.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a plant to be to the right of a towel within a scene. Both objects are described as stationary, so their relative positions are likely meaningful and stable.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for a plant to be right of a rabbit in a scene. The relationship conveys a logical spatial arrangement.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a horizontal piece of driftwood to be positioned above a moving goat in a scene, especially if the driftwood is lying across something elevated or the goat travels underneath. No evidence contradicts the spatial relationship.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a piece of driftwood to be spatially right of a mound of dirt in a scene. The spatial relationship 'right of' can be validly applied here based on typical physical arrangements.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a piece of driftwood to be 'right of' a plastic bag in a scene. There are no semantic or physical contradictions in the described arrangement.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one piece of driftwood to be spatially 'right of' another similar object in a scene, matching the provided descriptions and spatial predicate.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'right of' is spatial and plausible to describe the position of a piece of driftwood relative to another object, even if the object's details are missing. There is no information contradicting this spatial relationship.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for an irregular stationary object to be spatially 'right of' a goat in a video scene, and there is no information suggesting this relationship is incorrect.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'paper (uncertain) right of goat' is spatially plausible. The paper, stationary on the ground, can be to the right of the moving goat depending on their relative positions in the scene.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a paper to be left of a goat in a scene, given their described positions and states. No contradictory or redundant logic is present.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is physically and spatially plausible for a piece of paper to be left of a plant in a scene; nothing in the descriptions or attributes contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be spatially positioned to the right of a goat in a scene. Both objects are described as being present on the ground, supporting the spatial relationship 'plastic bag right of goat'.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'plastic bag left of goat' is spatially plausible and there is no indication that the relationship is redundant or physically impossible based on the descriptions provided.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'plastic bag left of plant' is plausible; one object can be positioned to the left of another in a scene and no physical or logical conflict exists between these objects in this spatial arrangement.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a leaf to be 'right of' a goat in a scene. The relationship makes sense as stated and requires no modification.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a leaf to be positioned left of a goat in a scene; the spatial predicate 'left of' correctly describes a possible arrangement between these two objects.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a leaf to be to the left of a plant, especially if the leaf is not attached or is a distinguishable object near the plant.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'plastic bag right of goat' is spatially plausible, as it's typical to describe one object's relative position to another in a scene with both fixed and moving entities.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a plastic bag to be positioned to the right of a mound of dirt. The relationship is both physically and semantically coherent given the scene descriptions.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'left of' is plausible here, as a plastic bag can be positioned to the left of an object resembling driftwood. No semantic or physical impossibility is indicated by the metadata.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a small wooden object to be right of a goat in a spatial scene. The relationship is semantically and physically correct as described.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a stationary small wooden object to be 'left of' a moving goat, as there is no contradiction or redundancy in this spatial relationship.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is physically and spatially plausible for a pink towel lying on the ground to be to the right of a moving goat in the scene. The relationship matches the possible spatial arrangement and there are no contradictions.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable and physically plausible for a towel to be to the left of a plant. Both objects are described as stationary and their physical characteristics do not make this spatial relationship unlikely.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a small rabbit to be positioned above a goat (e.g., on a higher surface, rock, or slope in the environment). Nothing in the descriptions contradicts the rabbit being above the goat spatially.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rabbit to be above a goat, for example if the rabbit is on a higher terrain or structure. The relationship is spatially and semantically reasonable with the given context.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a piece of driftwood to be above a goat, possibly due to the driftwood being in the air or positioned above the animal in the scene. The relationship makes semantic and physical sense.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible and semantically reasonable for a piece of driftwood to be described as 'right of' a mound of dirt in a video scene. The relationship is clear and correctly oriented.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for one piece of driftwood to be spatially 'left of' another, given the subject is gliding and the object is stationary. The relationship is semantically and physically plausible.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rabbit to be spatially to the right of a goat in a scene. The 'right of' predicate appropriately describes a physically possible spatial relationship between these two animals.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and common to spatially describe a rabbit as 'left of' a plant, as both can appear next to each other in a scene and the predicate 'left of' is semantically and physically appropriate.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "drop",
      "explanation": "The subject lacks a name or description, making it impossible to determine if it can be validly described as 'above' the specific goat. Without clear subject identity, the relationship cannot be validated.",
      "label": "insufficient_subject_info",
      "object_id": 1,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable to describe one object as being 'right of' a mound of dirt, given only spatial information—the subject's lack of a name does not affect the spatial plausibility.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "keep",
      "explanation": "Spatial relationships like 'left of' are generally plausible unless the physical arrangement is contradicted. Here, nothing suggests that subject 17 cannot be left of a stationary driftwood-like object.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a camera to be following a moving goat, especially as described in the video metadata. The relationship accurately reflects typical documentary or tracking footage.",
      "label": "reasonable",
      "object_id": -1,
      "predicate": "being followed by camera",
      "relation_type": "motion",
      "subject_id": 1
    },
    {
      "decision": "flip",
      "explanation": "'Camera tracking goat' is a typical scene description, but the current configuration has an unspecified subject and 'goat' as the object. The correct relationship should be 'goat camera tracking', meaning the camera tracks the goat. The subject and object should be flipped.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "camera tracking",
      "relation_type": "functional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'goat approaching goat' is semantically and physically plausible, especially given both are described as moving. There is no indication that subject and object should be flipped, and the direction of approach makes sense in this context.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "approaching",
      "relation_type": "motion",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'foraging near' between two goats, both exhibiting behaviors consistent with foraging, is semantically and physically plausible. No subject-object flip is needed and the predicate fits the scene descriptions.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "foraging near",
      "relation_type": "higher_order",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'foraging near' between two goats is plausible based on their described behaviors (moving, grazing, inspecting the ground) and physical proximity implied by the metadata. No reversal or removal is needed.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "foraging near",
      "relation_type": "higher_order",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The relationship has the goat foraging itself, which is redundant and not meaningful; an entity cannot 'forage' itself.",
      "label": "redundant_self_relation",
      "object_id": 1,
      "predicate": "foraging",
      "relation_type": "higher_order",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The relationship describes the goat 'foraging' itself, with both subject and object being the same goat, which is not semantically meaningful. Foraging predicates typically involve the animal and another entity (like food or ground), not itself.",
      "label": "self_relationship_redundant",
      "object_id": 2,
      "predicate": "foraging",
      "relation_type": "higher_order",
      "subject_id": 2
    }
  ],
  "relationships": [
    [
      1,
      3,
      "in front of",
      [
        [
          0,
          24
        ],
        [
          192,
          288
        ]
      ],
      "spatial"
    ],
    [
      1,
      4,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      6,
      "below",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      7,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      8,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      1,
      9,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      1,
      10,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      1,
      11,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      12,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      1,
      13,
      "left of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      1,
      14,
      "below",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      1,
      16,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      2,
      1,
      "right of",
      [
        [
          120,
          288
        ]
      ],
      "spatial"
    ],
    [
      2,
      3,
      "in front of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      2,
      8,
      "right of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      2,
      9,
      "right of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      2,
      10,
      "right of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      2,
      12,
      "right of",
      [
        [
          216,
          288
        ]
      ],
      "spatial"
    ],
    [
      2,
      14,
      "below",
      [
        [
          216,
          288
        ]
      ],
      "spatial"
    ],
    [
      3,
      1,
      "behind",
      [
        [
          0,
          24
        ],
        [
          192,
          288
        ]
      ],
      "spatial"
    ],
    [
      3,
      2,
      "behind",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      4,
      1,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      4,
      6,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      4,
      11,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      4,
      15,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      4,
      17,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      5,
      "under",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      5,
      8,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      5,
      9,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      5,
      10,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      5,
      13,
      "right of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      5,
      16,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      6,
      1,
      "above",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      6,
      4,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      6,
      11,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      6,
      15,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      6,
      17,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      7,
      1,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      8,
      1,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      8,
      2,
      "left of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      8,
      5,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      9,
      1,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      9,
      2,
      "left of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      9,
      5,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      10,
      1,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      10,
      2,
      "left of",
      [
        [
          120,
          192
        ]
      ],
      "spatial"
    ],
    [
      10,
      5,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      11,
      1,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      11,
      4,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      11,
      6,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      12,
      1,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      12,
      2,
      "left of",
      [
        [
          216,
          288
        ]
      ],
      "spatial"
    ],
    [
      13,
      1,
      "right of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      13,
      5,
      "left of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      14,
      1,
      "above",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      14,
      2,
      "above",
      [
        [
          216,
          288
        ]
      ],
      "spatial"
    ],
    [
      15,
      1,
      "above",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      15,
      4,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      15,
      6,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      16,
      1,
      "right of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      16,
      5,
      "left of",
      [
        [
          0,
          96
        ]
      ],
      "spatial"
    ],
    [
      17,
      4,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      17,
      6,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      -1,
      "being followed by camera",
      [
        [
          0,
          288
        ]
      ],
      "motion"
    ],
    [
      1,
      -1,
      "camera tracking",
      [
        [
          0,
          288
        ]
      ],
      "functional"
    ],
    [
      1,
      2,
      "approaching",
      [
        [
          120,
          192
        ]
      ],
      "motion"
    ],
    [
      1,
      2,
      "foraging near",
      [
        [
          192,
          288
        ]
      ],
      "higher_order"
    ],
    [
      2,
      1,
      "foraging near",
      [
        [
          192,
          288
        ]
      ],
      "higher_order"
    ]
  ],
  "video_id": "sav_000002"
}
