{
  "activity_differential": [
    "two people taking selfies in a shopping mall",
    "two people conversing and shopping together",
    "two people posing for photos in a decorated mall"
  ],
  "description": "A man and a woman are in a shopping mall, carrying bags and interacting. The man approaches the woman, they converse, and then take selfies together using a phone. The environment is decorated for the holidays, with Christmas trees and wreaths visible.",
  "place_env_id_name": "shopping mall",
  "relationship_filter_metadata": [
    {
      "decision": "keep",
      "explanation": "It is plausible and common for a handbag to be touching jeans, especially if the bag is being held or worn by someone, matching the described swaying and walking motion.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and contextually expected for a handbag to be below a person in the scene, and if the handbag is swaying above a tiled floor, it is reasonable to say the handbag is below (in the vertical dimension relative to) the tile surface.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "flip",
      "explanation": "Typically, a handbag would not be on top of a ceiling; instead, the ceiling would be above the handbag. Flipping the relationship makes it semantically and physically correct ('ceiling on top of handbag').",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a handbag (potentially carried or displayed) to be spatially to the right of a collection of garments, especially in a scene showing fashion items. The spatial relationship 'right of' makes sense here.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A handbag being 'left of' a ceiling does not make spatial sense; ceilings typically extend above everything in a scene, making this spatial relationship implausible.",
      "label": "physically_implausible",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is spatially feasible for a handbag (likely being carried and moving) to be in front of a wooden frame (stationary in the background). The predicate 'in front of' makes sense in this context.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a handbag to be right of a dress, as the handbag could be held or placed on one side of a person wearing the dress.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a handbag to be spatially 'right of' a wreath in a visual scene. Both objects are distinct and their descriptions support a spatial relationship without contradictions.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a handbag (especially one being carried or moving) to be positioned in front of a stationary railing within a scene. The spatial relationship 'in front of' is logical given the subject and object descriptions.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and coherent for a handbag (subject to motion and carried by a person) to be in front of a stationary wall panel within a scene. The spatial relationship described is natural.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a handbag to be in front of a dress, such as when someone carries the bag in front of their body. The given descriptions support the spatial relationship.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for jeans and a handbag to be touching, for example, if someone is carrying the handbag while wearing the jeans. The scene descriptions indicate movement in both objects, supporting the likelihood of spatial proximity and contact.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for jeans (being worn or on a person) to be below a tile floor, especially if someone is standing or walking on it.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is physically plausible for a ceiling to be on top of jeans, but it is not reasonable for jeans to be on top of a ceiling in most everyday contexts. The subject and object should be flipped for the relationship 'on top of' to make sense.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a pair of jeans to be spatially 'right of' a collection of garments if they are arranged in such a display, as commonly seen in a clothing store or wardrobe.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "It is not meaningful or physically plausible for 'jeans' to be described as 'left of' a 'ceiling' as they occupy fundamentally different spatial contexts; the ceiling is above, not to the right or left, of wearable clothing.",
      "label": "physically_impossible",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a moving pair of jeans (likely being worn by a person) to be in front of a stationary wooden frame, per the spatial predicate and object descriptions.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a pair of jeans to be to the right of a dress in a scene, especially if both items are visible and identified separately in the video.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for jeans to be right of a wreath in a physical space, and there is no semantic or physical impossibility in this spatial relationship.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pair of jeans (worn by a person) to be in front of a railing in a scene, especially as the jeans are described as moving through the sequence. The spatial relationship makes sense.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for jeans (being worn or moved by someone) to be in front of a stationary wall panel within a scene, fitting the spatial 'in front of' predicate.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pair of jeans to be spatially 'in front of' a dress in a scene, especially if both are moving or being worn. The spatial relation makes sense without additional context requiring reversal.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the handbag is above the tile floor, rather than the tile being above the handbag. The relationship should be flipped to maintain correct spatial logic.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the jeans (likely being worn by a person) are above the tile floor, rather than the floor being above the jeans. The subject and object should be flipped for correct spatial logic.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a ceiling to be on top of a tile floor, rather than a tile floor being on top of a ceiling, given standard spatial arrangements in architecture.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a tile (on the floor) to be 'right of' a set of garments (which are displayed), assuming a horizontal scene layout where both are visible. Nothing in the descriptions contradicts this possibility.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "A tile (on the floor) cannot be 'left of' the ceiling in a physical, spatial sense. The ceiling and the tile are typically separated vertically, not laterally, making this spatial relationship implausible.",
      "label": "physically_impossible",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a tile (on the floor) to be in front of a frame (standing upright in the scene), given standard scene arrangements. The spatial relationship 'in front of' makes sense contextually between these objects.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a large, glossy tile to be to the right of a dress in a spatial arrangement, especially on a tiled floor. The physical relationship makes sense given the scene description.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is physically and spatially plausible for a tile (on the floor) to be to the right of a wreath (placed somewhere in the scene), according to the viewer's reference. The relationship is clear and logically acceptable.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a railing to be positioned in front of a tiled floor in a scene, as railings are often near or at the edge of floors. The spatial relationship 'in front of' makes physical and semantic sense here.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a 'tile' (on the floor) to be described as 'in front of' a 'wall panel', especially if the tile is near the wall. Floor tiles are often described relative to nearby wall features in this way.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress to be in front of a tile (or tiled floor), especially in a scene where a person wearing the dress could be positioned closer to the viewer than the floor tiles. The spatial relationship 'in front of' makes semantic and visual sense in this context.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that a handbag is under a ceiling, not the other way around. Flipping the subject and object makes the relationship semantically correct.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is physically plausible for jeans to be under a ceiling, but not for a ceiling to be under jeans. Flipping the subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "Tiles are typically found under the ceiling, not the other way around. Flipping subject and object correctly represents the spatial relationship.",
      "label": "flipped",
      "object_id": 3,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the garments are under the ceiling than the ceiling being under the garments. The subject and object should be swapped to form a correct spatial relationship.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "A ceiling cannot physically be under another ceiling within the same spatial context—stacked ceilings are not a semantically reasonable relationship in typical architecture.",
      "label": "physically_impossible",
      "object_id": 7,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the frame is under the ceiling, as ceilings are typically above other objects in a scene. This suggests the subject and object should be reversed for an accurate spatial relationship.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is physically plausible for a dress to be under a ceiling (as would be typical inside a room), but not for a ceiling to be under a dress. Flipping the subject and object corrects the relationship.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "Typically, a wreath would be under a ceiling, not the ceiling under a wreath. Flipping the subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 13,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is far more plausible that the railing is under the ceiling, rather than the ceiling being under the railing. The current relationship should be flipped for accuracy.",
      "label": "flipped",
      "object_id": 14,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "The ceiling is typically above the wall panel, not under it. Flipping the subject and object would make the relationship correct: wall panel under ceiling.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "A dress is typically found under a ceiling, not the other way around. Flipping the subject and object makes the relationship correct as 'dress under ceiling'.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and semantically valid for a collection of garments (on hangers) to be physically left of a handbag in a scene, particularly in a retail or closet setting.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and semantically correct for a collection of garments to be spatially 'left of' a pair of jeans in a display or scene arrangement.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "'Garments left of tile' is too vague; tiles are usually a surface and do not have a clear lateral side for this relationship to be meaningful. The spatial relation does not make clear sense here.",
      "label": "spatially_vague",
      "object_id": 3,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments being 'on top of' a ceiling is not physically plausible; typically, ceilings are above garments in a scene, not the other way around.",
      "label": "physically_impossible",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "It is not physically plausible for garments to be 'left of' the ceiling; ceilings are above objects, not positioned to their right or left in conventional spatial terms.",
      "label": "physically_impossible",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for garments on hangers to be arranged in front of a wooden frame, such as a garment rack. The spatial relationship 'in front of' makes sense in this context.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable and common for a specific dress to be beside a collection of garments, especially in a display setting as described by the metadata.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and visually reasonable for a collection of garments (e.g., on a rack or display) and a wreath (e.g., as decoration) to be positioned beside each other in a scene, such as a shop display or festive setting.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for garments hanging on hangers to be arranged in front of a metal railing in a scene, matching both the physical arrangement and likely spatial layout suggested by the descriptions.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for garments (displayed or hanging) to be in front of a wall panel in a neat arrangement, matching typical spatial organization in rooms or display areas.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and contextually reasonable that a collection of garments could be spatially 'in front of' a dress in a clothing display or arrangement, given the subject and object descriptions.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "A ceiling cannot be 'right of' a handbag in any reasonable spatial configuration; the ceiling is an overarching structural element, while the handbag is a small, movable object within the space.",
      "label": "physically_impossible",
      "object_id": 1,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "A ceiling being described as 'right of' jeans is physically implausible, as ceilings are spatially above rather than to the side of wearable objects like jeans.",
      "label": "physically_implausible",
      "object_id": 2,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "It is not plausible for a ceiling to be 'right of' a tile, as ceilings are typically above floors or tiles, not spatially to the right in a standard physical orientation.",
      "label": "physically_impossible",
      "object_id": 3,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "The relationship claims one ceiling is 'on top of' another ceiling; however, both objects are described as ceilings and likely represent the same structural element. It is redundant and semantically incoherent to state a ceiling is on top of another ceiling in this context.",
      "label": "redundant",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "It is highly implausible for a ceiling to be spatially 'right of' garments since ceilings are typically overhead, not to the left or right of objects in a normal scene.",
      "label": "physically_implausible",
      "object_id": 6,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "It is highly unlikely for a ceiling to be physically 'in front of' a frame; ceilings are above while frames are typically on or near a wall or floor. The spatial relation does not make sense given the described objects.",
      "label": "physically_impossible",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "It is not physically plausible for a ceiling and a dress to be beside each other; a ceiling is an architectural feature above, not located laterally to objects like dresses.",
      "label": "physically_impossible",
      "object_id": 12,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "A ceiling cannot be physically beside a wreath; ceilings are overhead surfaces while wreaths are typically hung on walls or doors, making 'beside' an implausible spatial relationship here.",
      "label": "physically_impossible",
      "object_id": 13,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "A ceiling cannot be 'in front of' a railing in a typical spatial arrangement; ceilings are located above, not in front of railings in physical space.",
      "label": "physically_impossible",
      "object_id": 14,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "A ceiling cannot be 'in front of' a wall panel in typical spatial arrangements; the ceiling is above, and the wall panel is vertical, making this spatial relation implausible.",
      "label": "physically_implausible",
      "object_id": 15,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the dress is in front of the ceiling rather than the ceiling being in front of the dress, as ceilings are generally structural backgrounds and a dress would appear in front of it in a typical spatial arrangement.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a handbag to be positioned behind a stationary frame; the description does not indicate any physically impossible or semantically odd configuration.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'frame behind jeans' is spatially plausible, as a stationary frame can reasonably be located behind moving jeans within a scene. There is no semantic or physical impossibility.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a wooden frame to be positioned behind a tile or a section of tiled floor in a scene, based on spatial relationships.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "drop",
      "explanation": "It is not physically plausible for a ceiling to be on top of a frame; typically, a frame would be below the ceiling, not have the ceiling physically atop it.",
      "label": "physically_impossible",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for garments to be behind a prominent, upright, stationary wooden frame in a display or arrangement setting. The spatial relation matches the scene descriptions.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "drop",
      "explanation": "It is not plausible for a stationary wooden frame to be 'behind' the ceiling, since ceilings typically span overhead and are not objects behind which other objects are positioned in standard spatial layouts.",
      "label": "physically_implausible",
      "object_id": 7,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "A frame being to the left of a dress is spatially plausible in a scene, and there is nothing physically or semantically wrong with this relationship.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rectangular wooden frame to be left of a wreath, given their stationary and separate nature described in the metadata.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a wooden frame to be left of a railing, especially considering both objects are described as stationary structural elements.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a wooden frame to be touching a wall panel, especially since both objects are described as stationary and could be adjacent in the environment.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a wooden frame to be positioned to the left of a dress in a scene. The descriptors and actions do not contradict this spatial relationship.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a dress to be to the left of a handbag. The directionality of 'left of' makes sense with static or moving fashion items; there is no semantic or physical contradiction.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a dress to be to the left of a pair of jeans in a scene. The relationship is meaningful and not redundant.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and physically reasonable for a dress (being worn or placed) to be spatially 'left of' a tile (on the floor), as these are two distinct objects with reasonable spatial relationship in a scene.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "drop",
      "explanation": "A dress cannot be on top of a ceiling; this is physically implausible within typical spatial contexts.",
      "label": "physically_impossible",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and common for a dress (a specific garment) to be described as being beside a collection of other garments, especially in the context of a clothing display or wardrobe. The spatial relationship 'beside' is valid here.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "drop",
      "explanation": "A dress cannot be physically beside a ceiling, as they exist on very different spatial planes; this relationship is not plausible.",
      "label": "physically_impossible",
      "object_id": 7,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress to be spatially 'right of' a wooden frame in a scene, and nothing in the description contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress to be spatially 'left of' a wreath in a scene, as both are physical objects that can be positioned relative to each other.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a dress (potentially worn by a person) to be spatially located to the right of a railing in a scene, as these objects can exist side by side. The spatial relationship 'right of' makes sense here.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress (on a person or mannequin) to be positioned to the right of a stationary wall panel. The spatial relationship makes sense and does not violate physical or semantic logic.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one dress to be spatially to the right of another dress within a scene, especially if multiple similar objects are present and their locations are being described.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is physically and spatially plausible for a wreath to be to the left of a handbag in a scene, with no indicators that the relationship is redundant or flipped.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a wreath to be spatially located to the left of a pair of jeans in a scene, based on the descriptions provided. The relationship aligns with the 'left of' predicate and the physical setup.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a wreath to be physically located to the left of a tile, considering spatial arrangements in a scene. The spatial predicate 'left of' applies correctly between these objects.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that a wreath would be on top of a ceiling (such as hanging from it), rather than the ceiling being on top of a wreath. Flipping the subject and object makes the 'on top of' relationship physically reasonable.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and spatially coherent for a wreath to be described as beside garments in a scene, especially in a festive or decorative display context.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "drop",
      "explanation": "A wreath being 'beside' a ceiling does not make physical sense as 'ceiling' refers to an overhead surface and would not be positioned beside an object like a wreath. The spatial relationship is not plausible here.",
      "label": "physically_implausible",
      "object_id": 7,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a wreath to be right of a frame. Both objects are described as stationary and prominent, making their spatial relationship valid.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'wreath right of dress' is spatially plausible; one object (the wreath) can be physically located to the right of another (the dress) in a scene.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'wreath right of railing' is spatially plausible, as a wreath can be positioned to the right of a railing in a physical scene.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a wreath to be positioned to the right of a wall panel in a scene; the relationship is spatially sound.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible and contextually reasonable that a wreath could be positioned to the right of a dress in a video scene, given no contradictory attributes or physical violation.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a railing (stationary background feature) to be behind a handbag (foreground, moving object), matching expected spatial arrangement in a scene.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible and common for a railing to be behind a pair of jeans in a scene, such as when a person wearing jeans walks in front of a fixed railing.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a railing to be behind a tiled floor in a scene, especially given the typical layout where railings may border or be set behind a floor section.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "flip",
      "explanation": "It is more semantically and physically plausible for the railing to be on top of the ceiling than the ceiling to be on top of the railing. The current relationship implies the ceiling is on top of a railing, which contradicts typical space layouts.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for a railing to be behind garments, depending on the spatial arrangement in the scene. The description does not conflict with this relationship.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a railing to be positioned behind a ceiling from a particular viewpoint in the video, especially given the diagonal extension and different planes described in their attributes.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is spatially and physically plausible for a metallic railing to be to the right of a wooden frame; nothing in the descriptions makes this impossible or contradictory.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a railing to be located to the left of a dress in a scene. The spatial predicate 'left of' is used correctly here given the described static positions of both objects.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a metallic railing to be 'left of' a wreath in a scene. The relationship makes sense and matches typical spatial relations in an environment.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a metallic railing to be physically touching a wall panel, especially given common architectural configurations where railings are attached or adjacent to walls.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a metallic railing to be described as 'left of' a dress in a scene, given that both can occupy spatially distinct locations and this aligns with common scene layouts.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a wall panel to be behind a handbag, as the wall is a large, stationary background object and the handbag is a smaller, moving foreground object.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for jeans (likely worn by a person) to be in front of a large wall panel, making 'wall panel behind jeans' a reasonable interpretation.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a wall panel to be behind a tile floor in a scene, as wall panels are typically vertical elements positioned behind or at the edge of floor surfaces.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "flip",
      "explanation": "Ceilings are generally on top of wall panels, not the other way around. Flipping the subject and object makes the spatial relationship semantically correct.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and common for garments to be in front of a wall panel in a scene, making the statement 'wall panel behind garments' spatially reasonable.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "drop",
      "explanation": "A 'wall panel' being 'behind' a 'ceiling' does not make spatial sense within typical built environments. Ceilings are generally above or parallel to wall panels, not in front or behind them from a normal perspective.",
      "label": "physically_implausible",
      "object_id": 7,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a wall panel to be touching a wooden frame, especially if the frame is mounted on or adjacent to the panel. Both objects are described as stationary and large, making their contact spatially reasonable.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a large, stationary wall panel to be spatially left of a dress, as spatial relationships between such objects are meaningful and common in indoor scenes.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is spatially reasonable for a wall panel to be described as 'left of' a wreath. There is no indication that this arrangement is physically impossible, and both objects are stationary, implying fixed relative positions.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a wall panel and a railing to be in contact (touching) in an architectural or building context, as railings are often attached to or touch walls or panels.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "A wall panel being 'left of' a dress is a plausible spatial relationship, as the stationary panel serves as a fixed reference while the dress moves through the scene. The description supports their relative positions being established visually.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a dress to be behind a handbag in the spatial context, as these two objects can be positioned relative to each other this way in a scene.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is physically and spatially plausible for a dress to be behind a pair of jeans in a scene; there is no contradiction in this ordering.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "drop",
      "explanation": "It is not logically meaningful for a dress to be 'behind' a tile floor, as the floor is a surface covering the scene; the relationship does not make spatial sense.",
      "label": "spatially_implausible",
      "object_id": 3,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "A ceiling is typically on top of a dress in a physical scene, not the other way around. The relationship should be 'ceiling on top of dress' to be plausible.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a specific dress to be described as 'behind' a collection of garments, e.g., if the dress is positioned further away from the viewer or obscured by other hanging garments. The spatial relationship 'behind' makes semantic and physical sense here.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "drop",
      "explanation": "A dress cannot be spatially 'behind' a ceiling, as the ceiling is typically above and spans the entire upper portion of a space; these elements do not share a plausible behind/in-front spatial relationship.",
      "label": "physically_impossible",
      "object_id": 7,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress to be spatially 'left of' a wooden frame in a scene, especially since the objects are distinct and their positions can be described relative to each other.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one dress to be spatially 'left of' another in a scene, and both objects are distinct despite being similar in type. The spatial relationship makes sense.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress to be located to the left of a wreath in a scene. The predicate 'left of' is appropriate for these distinct objects and there is no evidence suggesting a need to flip or drop the relationship.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a dress to be left of a railing in the scene. The relationship does not violate semantic or physical constraints.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a dress to be to the left of a wall panel in a scene, and the predicate 'left of' sensibly represents a spatial relationship between the two.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "drop",
      "explanation": "It is not plausible for a collection of garments to hold a handbag; only an animate being or an object designed to hold could do so. The relationship is physically impossible in this context.",
      "label": "physically_impossible",
      "object_id": 1,
      "predicate": "holding",
      "relation_type": "functional",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "It is not plausible for a collection of garments to functionally hold a pair of jeans; typically, a person or hanger holds garments, not the garments themselves holding each other.",
      "label": "physically_impossible",
      "object_id": 2,
      "predicate": "holding",
      "relation_type": "functional",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments cannot wear tiles; the predicate 'wearing' only makes sense for a person or animal wearing garments or items, not garments and tiles.",
      "label": "physically_impossible",
      "object_id": 3,
      "predicate": "wearing",
      "relation_type": "functional",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments cannot wear a dress; it should be a person wearing garments or a dress. This relationship between garments and a dress as wearer and worn is physically meaningless.",
      "label": "physically_impossible",
      "object_id": 12,
      "predicate": "wearing",
      "relation_type": "functional",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments cannot wear a wreath; only animate subjects or mannequins could plausibly wear something, not inanimate objects like a collection of clothes or a wreath.",
      "label": "physically_impossible",
      "object_id": 13,
      "predicate": "wearing",
      "relation_type": "functional",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments cannot be 'wearing' another object; 'wearing' relationships are typically only valid with animate subjects capable of dressing.",
      "label": "physically_impossible",
      "object_id": 19,
      "predicate": "wearing",
      "relation_type": "functional",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments do not have the capacity to direct attention or 'look at' anything, including a ceiling. This relationship is not physically or semantically plausible.",
      "label": "physically_implausible",
      "object_id": 7,
      "predicate": "looking at",
      "relation_type": "attentional",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a collection of garments (such as clothing on hangers) to be approaching a stationary wooden frame, perhaps as the garments are being moved closer to the frame for display or hanging. The predicate 'approaching' makes sense given the motion relation type and descriptions.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "approaching",
      "relation_type": "motion",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments (clothes) cannot perform the action 'walking'; this predicate is not physically plausible when the subject and object are garments.",
      "label": "physically_impossible",
      "object_id": 6,
      "predicate": "walking",
      "relation_type": "higher_order",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "The subject and object are the same (garments), making this relationship redundant and uninformative in this context.",
      "label": "redundant",
      "object_id": 6,
      "predicate": "standing",
      "relation_type": "higher_order",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "The subject and object are the same ('garments') and using the 'posing' predicate here does not make sense, as garments cannot 'pose' and the relationship is self-referential.",
      "label": "redundant_self_relation",
      "object_id": 6,
      "predicate": "posing",
      "relation_type": "higher_order",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments cannot take selfies, especially not with themselves. The relationship is not physically or semantically plausible.",
      "label": "physically_impossible",
      "object_id": 6,
      "predicate": "taking selfie with",
      "relation_type": "higher_order",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Garments cannot 'converse'; 'conversing with' is a social predicate that only applies to sentient beings, not inanimate objects like clothes.",
      "label": "physically_impossible",
      "object_id": 6,
      "predicate": "conversing with",
      "relation_type": "social",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "The subject and object are the same ('garments'), making the 'interacting with' relationship redundant and nonsensical in this context.",
      "label": "redundant_self_relation",
      "object_id": 6,
      "predicate": "interacting with",
      "relation_type": "social",
      "subject_id": 6
    }
  ],
  "relationships": [
    [
      1,
      2,
      "touching",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      3,
      "below",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      1,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      6,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      9,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      12,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      13,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      14,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      15,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      11,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      1,
      "touching",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      3,
      "below",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      2,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      6,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      9,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      12,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      13,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      14,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      15,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      11,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      3,
      "above",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      3,
      "above",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      3,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      6,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      9,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      12,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      13,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      14,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      15,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      11,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      4,
      "under",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      1,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      2,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      9,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      12,
      "beside",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      13,
      "beside",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      14,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      15,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      11,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      7,
      "in front of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      1,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      2,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      3,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      6,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      12,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      13,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      14,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      15,
      "touching",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      9,
      11,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      1,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      2,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      3,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      6,
      "beside",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      9,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      13,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      14,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      15,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      12,
      11,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      1,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      2,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      3,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      13,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      6,
      "beside",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      9,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      12,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      14,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      15,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      11,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      1,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      2,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      3,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      14,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      6,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      7,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      9,
      "right of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      12,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      13,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      15,
      "touching",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      11,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      1,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      2,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      3,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      15,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      6,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      9,
      "touching",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      12,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      13,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      14,
      "touching",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      15,
      11,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      1,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      2,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      4,
      11,
      "on top of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      6,
      "behind",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      9,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      12,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      13,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      14,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      11,
      15,
      "left of",
      [
        [
          0,
          144
        ]
      ],
      "spatial"
    ],
    [
      6,
      9,
      "approaching",
      [
        [
          0,
          72
        ]
      ],
      "motion"
    ]
  ],
  "video_id": "sav_000004"
}
