{
  "activity_differential": [
    "group of adults socializing in a park at night",
    "adults conversing and gesturing in a recreational area",
    "group gathering and interacting under streetlights"
  ],
  "description": "A group of adults are gathered on a grassy area at night, some standing, some interacting, with one person sitting on the ground. A child is in the foreground, facing away from the group. The environment is an outdoor park or recreational area, illuminated by streetlights.",
  "place_env_id_name": "outdoor park",
  "relationship_filter_metadata": [
    {
      "decision": "flip",
      "explanation": "A bottle is unlikely to be on top of a person; more plausible that the person is holding or placing the bottle on a surface.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "A person can stand left of a trash can, but a trash can 'standing left of' a person is less natural; flipping subject and object aligns with common spatial descriptions.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "standing left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "The streetlight stands taller and is more likely to be behind the trash can; flipping subject and object makes the 'standing behind' predicate physically plausible.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "standing behind",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A wall typically is behind a trash can, not the other way around; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "Grass is a ground surface and the trash can stands on it; stating the trash can is behind the grass is incorrect, reversing subject and object clarifies the spatial relationship.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A bottle can be on top of a trash can, but a trash can on top of a bottle is physically implausible; reversing subject/object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A bottle is more likely to be behind a trash can rather than the trash can being behind the bottle; flipping the subject and object aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A bottle cannot be physically on top of a streetlight; it is more plausible the streetlight is on top of the bottle if the description supported that, but given typical real-world contexts, flipping subject and object to consider if the bottle is on top of the streetlight makes more sense. However, likely the intended meaning was the streetlight is above the bottle, so flipping corrects the spatial predicate.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "A person can be behind a surface, not the surface behind the person; flipping subject and object aligns with typical spatial relationships.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A person can be behind a surface, but a surface being behind a person is unlikely; reversing subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "Typically, a trash can would be behind a surface rather than the surface being behind the trash can; flipping subject and object aligns with common spatial arrangement.",
      "label": "flipped",
      "object_id": 5,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "The streetlight is likely positioned behind the surface, not the surface behind the streetlight; flipping subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A wall typically stands behind a surface (like a slab), not the other way around. Flipping subject and object aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "The grass is likely behind the large flat surface, not the other way around; flipping subject and object makes the spatial relationship plausible.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "The bottle is likely in front of the surface rather than the surface being behind the bottle; flipping subject and object corrects the spatial predicate.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A large flat surface is unlikely to be behind a small bottle; the bottle is more plausibly behind the surface from the viewer's perspective. Flipping subject and object makes the spatial relation correct.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A jersey cannot be 'behind' a large, flat, solid surface; it is more plausible that the surface is behind the jersey, so flipping subject and object makes spatial sense.",
      "label": "flipped",
      "object_id": 13,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A person can be in front of a wall, not the wall in front of the person; flipping the relationship corrects the spatial predicate.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "A leg in motion is more plausibly in front of a stationary wall than the wall in front of the leg; flipping corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 3,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Typically, a person stands in front of a wall, not the wall in front of the person; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Typically, a trash can is in front of a wall, not the wall in front of a trash can; flipping subject and object makes the spatial relation correct.",
      "label": "flipped",
      "object_id": 5,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Typically, a streetlight is in front of a wall rather than the wall being in front of the streetlight; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Typically, a table is positioned in front of a wall, not the other way around; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Grass is on top of the wall in physical reality; flipping subject and object aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "The bottle is likely in front of the wall, not the other way around; flipping the subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "A bottle can be on top of a wall, but a wall cannot be on top of a bottle; flipping subject and object makes the relationship physically plausible.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "A jersey can be on top of a wall, but a wall cannot be on top of a jersey; flipping subject and object makes the relationship physically plausible.",
      "label": "flipped",
      "object_id": 13,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "A table is unlikely to be behind a person; more plausible that the person is behind the table.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "Since the leg is in motion in front of the table, saying the table is behind the leg would be more accurate if subject and object are reversed.",
      "label": "flipped",
      "object_id": 3,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The person is likely behind the table rather than the table being behind the person, so flipping subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A stationary trash can is likely behind a stationary table rather than the other way around, so flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 5,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A table is unlikely to be behind a streetlight given the typical scene layout; flipping the subject and object makes the streetlight behind the table, which is more plausible.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The wall is typically behind the table, not the other way around; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The grass is likely behind the table, not the table behind the grass; flipping subject/object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A bottle is typically positioned on or supported by a table, so the bottle is likely in front of the table, not behind it; flipping subject/object aligns with this spatial logic.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The bottle is likely on the table, so flipping the relationship to 'bottle behind table' is more plausible than 'table behind bottle'.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A jersey can be behind a table, but the given subject is the table and object is the jersey with predicate 'behind'. Flipping to 'jersey behind table' makes the spatial relationship semantically plausible.",
      "label": "flipped",
      "object_id": 13,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A table is unlikely to be to the right of a streetlight; it is more plausible that the streetlight is to the right of the table, so flipping subject and object makes the spatial relation correct.",
      "label": "flipped",
      "object_id": 14,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the person is in front of the grass, not the grass in front of the person; flipping subject and object aligns with typical spatial relationships.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "A person can be in front of grass, but grass being in front of the person is less plausible; flipping the relationship makes spatial sense.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "A leg can be in front of grass, but grass being in front of a leg is spatially illogical; flipping subject and object corrects the relationship.",
      "label": "flipped",
      "object_id": 3,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "The person is likely in front of the grass rather than the grass being in front of the person, so flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "The grass is on the ground and the wall stands above it; flipping subject and object makes the spatial relation 'under' accurate.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "A bottle is typically in front of (or placed on) grass rather than grass being in front of a bottle; reversing subject and object aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "A bottle can be on top of grass, but grass cannot be on top of a bottle; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "Physically, a jersey can be on top of grass, not the other way around; flipping subject and object makes the relationship accurate.",
      "label": "flipped",
      "object_id": 13,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "A streetlight is unlikely to be to the left of grass in this spatial relationship; reversing subject and object makes 'grass is right of streetlight' plausible.",
      "label": "flipped",
      "object_id": 14,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "The bottle is described as remaining upright and steady, likely supported by the person; stating the bottle is 'under' the person is physically less plausible than the person being under or above the bottle.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "A bottle cannot realistically be 'under' a person; it is more plausible that the person is 'under' the bottle in the scene, reversing subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "The bottle is described as upright and steady, likely on or held by the person; therefore, the person is under the bottle is unlikely. Flipping subject and object aligns with spatial predicate 'under'.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "A bottle cannot be 'under' a streetlight in a direct spatial sense, but the bottle can be under the streetlight. Flipping subject and object makes the relationship correct.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "A bottle is typically positioned on or above a surface; saying it is 'under' a surface is incorrect. Flipping the subject and object makes the relationship 'surface under bottle', which is physically plausible.",
      "label": "flipped",
      "object_id": 7,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "The table is likely in front of the bottle from the viewer's perspective, so flipping the subject and object aligns the spatial relationship correctly.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "flip",
      "explanation": "The bottle is likely on or in front of the surface; saying the bottle is 'in front of' the surface with the surface as object is reversed. Flipping subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 7,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "flip",
      "explanation": "The bottle is likely on or in front of the table, not the other way around; flipping subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "flip",
      "explanation": "The grass is likely under the bottle, not the bottle under the grass; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "flip",
      "explanation": "The person is likely in front of the jersey, not the jersey in front of the person; flipping aligns the spatial relationship with typical real-world arrangement.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A jersey cannot spatially be in front of a person; rather, the person wears or holds the jersey, so flipping subject and object makes the relationship plausible.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A person is logically in front of a jersey; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "Grass typically lies under a jersey, not vice versa; reversing subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the person is walking away from the leg, as a leg itself cannot walk away from a person; flipping the relationship corrects the predicate.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "walking away from",
      "relation_type": "motion",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "A trash can cannot walk away from a person; reversing subject and object aligns with a person walking away from the trash can.",
      "label": "flipped",
      "object_id": 4,
      "predicate": "walking away from",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A bottle standing on a trash can is plausible if bottle is on the trash can; reversing subject/object clarifies the spatial relationship.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "standing on",
      "relation_type": "functional",
      "subject_id": 5
    }
  ],
  "relationship_filter_summary": {
    "flipped_relationships": 63,
    "source_file": "tmp/new_sav_000_100_filtered/sav_000012.json",
    "total_relationships": 247
  },
  "relationships": [
    [
      10,
      3,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      4,
      "standing left of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      5,
      4,
      "standing behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      7,
      4,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      9,
      4,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      10,
      4,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      11,
      4,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      10,
      5,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      1,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      4,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      5,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      7,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      9,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      10,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      11,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      12,
      6,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      0,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      2,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      4,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      5,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      8,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      9,
      7,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      10,
      7,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      11,
      7,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      12,
      7,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      1,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      2,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      4,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      5,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      7,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      9,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      10,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      11,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      12,
      8,
      "behind",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      13,
      8,
      "right of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      0,
      9,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      1,
      9,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      2,
      9,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      9,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      7,
      9,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      10,
      9,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      11,
      9,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      12,
      9,
      "on top of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      13,
      9,
      "right of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      0,
      10,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      1,
      10,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      10,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      5,
      10,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      6,
      10,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      8,
      10,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      6,
      11,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      8,
      11,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      9,
      11,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      0,
      12,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      1,
      12,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      12,
      "in front of",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      9,
      12,
      "under",
      [
        [
          0,
          240
        ]
      ],
      "spatial"
    ],
    [
      3,
      2,
      "walking away from",
      [
        [
          96,
          144
        ]
      ],
      "motion"
    ],
    [
      3,
      4,
      "walking away from",
      [
        [
          96,
          144
        ]
      ],
      "motion"
    ],
    [
      10,
      4,
      "standing on",
      [
        [
          0,
          240
        ]
      ],
      "functional"
    ]
  ],
  "video_id": "sav_000012",
  "objects": [
    {
      "object_id": 0,
      "category": "person",
      "attributes": [
        "dark",
        "loose-fitting"
      ]
    },
    {
      "object_id": 1,
      "category": "person",
      "attributes": [
        "light-colored shirt",
        "dark shorts"
      ]
    },
    {
      "object_id": 2,
      "category": "person (uncertain)",
      "attributes": [
        "light-colored",
        "soft",
        "comfortable"
      ]
    },
    {
      "object_id": 3,
      "category": "leg (uncertain)",
      "attributes": [
        "slender",
        "elongated",
        "smooth",
        "slightly reflective"
      ]
    },
    {
      "object_id": 4,
      "category": "person",
      "attributes": [
        "light-colored",
        "oversized",
        "short",
        "dark"
      ]
    },
    {
      "object_id": 5,
      "category": "trash can",
      "attributes": [
        "large",
        "dark green",
        "smooth",
        "slightly reflective",
        "tall",
        "rectangular",
        "slightly domed lid",
        "robust"
      ]
    },
    {
      "object_id": 6,
      "category": "streetlight",
      "attributes": [
        "metallic",
        "rectangular",
        "bright",
        "steady",
        "subtle",
        "clear",
        "focused"
      ]
    },
    {
      "object_id": 7,
      "category": "surface (uncertain)",
      "attributes": [
        "large",
        "flat",
        "smooth",
        "uniform texture",
        "slightly rough finish",
        "consistent shape",
        "consistent size",
        "straight edges",
        "well-defined edges",
        "uniform appearance"
      ]
    },
    {
      "object_id": 8,
      "category": "wall",
      "attributes": [
        "rectangular",
        "smooth",
        "uniform",
        "warm",
        "earthy",
        "horizontal",
        "slightly distinct",
        "natural",
        "unmarred"
      ]
    },
    {
      "object_id": 9,
      "category": "table (uncertain)",
      "attributes": [
        "light brown",
        "smooth",
        "matte",
        "flat",
        "straight-edged",
        "sturdy",
        "uniform color",
        "uniform texture"
      ]
    },
    {
      "object_id": 10,
      "category": "grass",
      "attributes": [
        "green",
        "dense",
        "vibrant",
        "consistent-textured",
        "healthy",
        "gentle-undulating",
        "uniform"
      ]
    },
    {
      "object_id": 11,
      "category": "bottle",
      "attributes": [
        "vibrant red",
        "gradient of amber hues",
        "cylindrical",
        "smooth",
        "glossy",
        "warm tones",
        "amber"
      ]
    },
    {
      "object_id": 12,
      "category": "bottle",
      "attributes": [
        "vibrant red-cap",
        "translucent body",
        "smooth and glossy",
        "slightly tapered",
        "gentle curve",
        "plastic",
        "clear body",
        "sleek and modern"
      ]
    },
    {
      "object_id": 13,
      "category": "jersey",
      "attributes": [
        "predominantly white",
        "subtle sheen",
        "lightweight",
        "breathable",
        "large bold graphic",
        "short-sleeved",
        "round-necked",
        "casual sporty",
        "consistent shape",
        "textured",
        "contoured design"
      ]
    },
    {
      "object_id": 14,
      "category": "streetlight (uncertain)",
      "attributes": [
        "bright",
        "glowing",
        "rounded",
        "slightly elongated",
        "smooth",
        "opaque",
        "uniform surface",
        "sleek",
        "minimalist"
      ]
    },
    {
      "object_id": -1,
      "category": "camera",
      "attributes": []
    }
  ]
}