{
  "activity_differential": [
    "adult and child walking together through flower shop walkway",
    "camera panning and moving through garden area",
    "adult supervising child in outdoor flower shop"
  ],
  "description": "A camera moves through a flower shop or garden area at night, following two people (one adult, one child) walking along a pathway lined with plants and flowers. The camera then pans and moves past the people, focusing on the plants, flowers, and outdoor area.",
  "place_env_id_name": "flower shop outdoor walkway",
  "relationship_filter_metadata": [
    {
      "decision": "flip",
      "explanation": "A boot cannot stand left of a person independently; more plausible that the person is standing left of the boot or that the boot is on the person. Flipping the relationship corrects the spatial predicate.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "standing left of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "A boot is unlikely to be under a flowerpot; the flowerpot is more plausibly on or above the boot, so flipping subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "The plant is lush and likely rooted in the ground, so the boot cannot be 'under' the plant; flipping the relationship to 'plant under boot' matches the usual spatial arrangement of a boot moving over or above a plant.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "Typically, a person can be under a bush, but a bush cannot be under a person; flipping the subject and object aligns with physical and spatial plausibility.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A boot can be under a bush, but a bush being under a boot is physically implausible; flipping subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A person can be under a bush, but a bush being under a person is physically implausible; flipping subject and object corrects the spatial relation.",
      "label": "flipped",
      "object_id": 3,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A bush cannot realistically be under a flowerpot; typically, a flowerpot sits under or on/near a bush. Reversing subject and object aligns the spatial relationship correctly.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "A bush cannot be under a door; reversing the subject and object to 'door under bush' is more plausible spatially.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "The person, as a human figure, is likely in front of the flowers, so flipping makes 'person behind flowers' corrected to 'flowers behind person' which fits the spatial placement.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "A boot is likely behind the flowers rather than the flowers being behind the boot given their descriptions; flipping subject/object makes the spatial relationship more plausible.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "Flowers are typically in or on a flowerpot, so the flowerpot is under the flowers; reversing subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "The flowers would not be under the door; instead, the door is likely behind or above the flowers. Flipping the subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "The flowers are more likely to be on or part of the plant rather than under it; flipping subject and object aligns with natural spatial arrangement.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "The person is in front walking, and the tall plant is likely behind the person; flipping subject and object makes the spatial 'behind' predicate correct.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A plant cannot be 'under' a flowerpot; the plant is likely inside or on top of the flowerpot, so flipping subject and object makes the spatial relation correct.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "A plant is unlikely to be spatially under a door; the door is more plausibly above or in front of the plant. Flipping subject and object makes the 'under' predicate physically plausible.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "flip",
      "explanation": "Typically, a flowerpot would be under a light fixture, not the other way around; reversing subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "A door would be under a light fixture, not the other way around; flipping subject and object makes the spatial relation plausible.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Typically, a plant would be under a light fixture rather than the light fixture being under the plant; reversing subject and object aligns the spatial relationship correctly.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Flowers are typically inside or over a flowerpot, not the flowerpot over the flowers; reversing subject and object aligns with physical reality.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "Typically, a plant would be 'over' a flowerpot if it is growing out of it; reversing the subject and object makes the spatial relationship correct.",
      "label": "flipped",
      "object_id": 7,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A flowerpot is unlikely to be physically 'over' a hanging light fixture; reversing the subject and object to 'light fixture over flowerpot' is more plausible.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the plant is over the flowerpot rather than the flowerpot being over the plant, so flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 14,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The plant is typically over the flowerpot, not the other way around; flipping aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "Given the descriptions, the crossbar is likely positioned over the flowerpot rather than the flowerpot being over the crossbar; flipping subject and object makes the spatial relationship more plausible.",
      "label": "flipped",
      "object_id": 16,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The flower arrangement is positioned over the flowerpot, not the other way around; flipping subject and object makes the spatial relation 'over' correct.",
      "label": "flipped",
      "object_id": 17,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "The plant is typically over the flowerpot, not vice versa; flipping subject and object aligns with real-world spatial arrangement.",
      "label": "flipped",
      "object_id": 18,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "A crossbar is typically positioned over or above a door, not the door over the crossbar; flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 16,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the person is behind the bush rather than the bush being behind the person, given common spatial relationships in scene descriptions.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A boot moving is unlikely to be behind a stationary bush; better to say the boot is in front of or the bush is behind the boot, flipping subject/object resolves the spatial relation meaningfully.",
      "label": "flipped",
      "object_id": 2,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "Typically flowers are positioned in front of bushes; flipping subject and object corrects the spatial relationship to reflect the flowers being in front and the bush behind.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "The tall, slender plant is more likely to be behind the bush rather than the bush behind the plant given their described sizes and prominence.",
      "label": "flipped",
      "object_id": 7,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A bush is typically in front of or beside a light fixture; it is more plausible that the light fixture is behind the bush rather than the bush being behind the light fixture.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A bush is unlikely to be under a flowerpot; typically, a flowerpot would be on or above a bush or ground. Flipping subject and object makes the spatial relation 'flowerpot under bush' plausible if the bush overhangs the flowerpot.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A bush cannot be under a door; it's more plausible that the door is under or behind the bush, so flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "A bush cannot physically be under a plant; flipping the subject and object so the plant is under the bush makes more spatial sense given their descriptions.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "flip",
      "explanation": "The plant with leaves described is likely growing in or on the flowerpot, so the flowerpot is under the plant, not the other way around. Flipping subject and object makes the relationship plausible.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the person (wearing a coat) is over the plant, rather than the plant being over the person.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "flip",
      "explanation": "The plant cannot be over the light fixture; it is more plausible that the light fixture is over the plant.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "flip",
      "explanation": "A plant is typically over a flowerpot, meaning the flowerpot supports the plant, so flipping subject and object makes the relationship semantically correct.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "flip",
      "explanation": "A plant typically grows in or is supported by a flowerpot; thus, the flowerpot is 'over' the plant is unlikely, reversing subject and object makes the relationship plausible.",
      "label": "flipped",
      "object_id": 27,
      "predicate": "over",
      "relation_type": "spatial",
      "subject_id": 15
    },
    {
      "decision": "flip",
      "explanation": "The person is likely in front of the crossbar, so flipping subject and object makes 'person behind crossbar' plausible.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "flip",
      "explanation": "A flowerpot is more likely to be under the crossbar rather than the crossbar under the flowerpot; flipping subject and object aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "flip",
      "explanation": "The description suggests the 'door' is vertical and the 'crossbar' is horizontal and below it; thus, the door is likely above the crossbar. Flipping subject and object makes the 'under' predicate correct.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "flip",
      "explanation": "A plant can be under a crossbar but not vice versa; flipping subject and object aligns with typical spatial arrangement.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "flip",
      "explanation": "Typically, a flower arrangement is placed in or on top of a flowerpot, not under it. Reversing the subject and object makes the spatial relation 'flowerpot under flower arrangement' correct.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "flip",
      "explanation": "A door is typically above or behind a flower arrangement, so flipping the relationship to 'door above flower arrangement' makes spatial sense.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "flip",
      "explanation": "A flower arrangement is unlikely to be physically under a plant. It is more plausible that the plant is under the flower arrangement, so flipping the subject and object makes the spatial relation 'under' reasonable.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "flip",
      "explanation": "The plant is described as positioned on the left side, so it is more accurate to say the flower arrangement is to the right of the plant; flipping subject and object corrects the 'left of' predicate.",
      "label": "flipped",
      "object_id": 18,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the person is in front of the plant, so flipping subject and object aligns with the spatial predicate 'behind' when correctly oriented.",
      "label": "flipped",
      "object_id": 1,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "flip",
      "explanation": "A plant typically is in or on a flowerpot, not under it; flipping the relationship aligns with physical reality.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "flip",
      "explanation": "A plant is unlikely to be under a door; it is more plausible that the door is above or behind the plant, so flipping subject and object corrects the spatial relation.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "flip",
      "explanation": "The plant is described as positioned on the left side and the flower arrangement implied to be on the right; flipping the relationship to 'flower arrangement right of plant' makes the spatial predicate correct.",
      "label": "flipped",
      "object_id": 17,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "flip",
      "explanation": "Flowers are likely in the flowerpot, so the relationship 'left of' should have flowers as the subject and flowerpot as the object for spatial correctness.",
      "label": "flipped",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 27
    },
    {
      "decision": "flip",
      "explanation": "The flowerpot is unlikely to be under the door; more reasonable is that the door is above the flowerpot.",
      "label": "flipped",
      "object_id": 12,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 27
    },
    {
      "decision": "flip",
      "explanation": "Plants typically grow in or on flowerpots, so the plant is more plausibly 'in' or 'on' the flowerpot rather than 'under' it. Flipping subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 15,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 27
    }
  ],
  "relationship_filter_summary": {
    "flipped_relationships": 56,
    "source_file": "tmp/new_sav_000_100_filtered/sav_000068.json",
    "total_relationships": 240
  },
  "relationships": [
    [
      0,
      1,
      "standing left of",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      1,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      14,
      1,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      0,
      4,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      1,
      4,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      2,
      4,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      4,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      11,
      4,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      0,
      5,
      "behind",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      1,
      5,
      "behind",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      5,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      11,
      5,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      14,
      5,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      0,
      6,
      "behind",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      6,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      11,
      6,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      7,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      11,
      7,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      14,
      7,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      5,
      8,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      6,
      8,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      7,
      8,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      13,
      8,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      14,
      8,
      "over",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      15,
      8,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      16,
      8,
      "over",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      17,
      8,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      15,
      11,
      "over",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      0,
      12,
      "behind",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      1,
      12,
      "behind",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      5,
      12,
      "behind",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      6,
      12,
      "behind",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      7,
      12,
      "behind",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      8,
      12,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      11,
      12,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      14,
      12,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      8,
      13,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      0,
      14,
      "over",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      7,
      14,
      "over",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      8,
      14,
      "over",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      26,
      14,
      "over",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      0,
      15,
      "behind",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      15,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      11,
      15,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      14,
      15,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      8,
      16,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      11,
      16,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      14,
      16,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      17,
      16,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      0,
      17,
      "behind",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      8,
      17,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      11,
      17,
      "under",
      [
        [
          0,
          48
        ]
      ],
      "spatial"
    ],
    [
      16,
      17,
      "right of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      5,
      26,
      "left of",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      11,
      26,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ],
    [
      14,
      26,
      "under",
      [
        [
          0,
          24
        ]
      ],
      "spatial"
    ]
  ],
  "video_id": "sav_000068",
  "objects": [
    {
      "object_id": 0,
      "category": "person",
      "attributes": [
        "dark-jacketed",
        "padded-jacketed",
        "dark-pantsed",
        "sturdy-shoed",
        "soft-glowed",
        "subtle-textured"
      ]
    },
    {
      "object_id": 1,
      "category": "person",
      "attributes": [
        "deep maroon color",
        "smooth texture",
        "rich hue"
      ]
    },
    {
      "object_id": 2,
      "category": "boot",
      "attributes": [
        "dark-colored",
        "robust",
        "slightly rounded",
        "durable",
        "rugged",
        "thick",
        "slightly textured",
        "slightly elevated",
        "snug fit",
        "moderately high"
      ]
    },
    {
      "object_id": 3,
      "category": "person",
      "attributes": [
        "dark",
        "hooded",
        "casual",
        "relaxed"
      ]
    },
    {
      "object_id": 4,
      "category": "pathway",
      "attributes": [
        "narrow",
        "elongated",
        "muted blend of earthy tones",
        "subtle variations in texture",
        "linear form"
      ]
    },
    {
      "object_id": 5,
      "category": "bush",
      "attributes": [
        "lush",
        "verdant",
        "dense",
        "robust",
        "vibrant",
        "deep green",
        "thick",
        "abundant",
        "small",
        "distinct",
        "full",
        "healthy",
        "subtle sheen"
      ]
    },
    {
      "object_id": 6,
      "category": "flowers",
      "attributes": [
        "vibrant",
        "yellow and green",
        "delicate",
        "dense",
        "lush",
        "full",
        "vivid",
        "textured"
      ]
    },
    {
      "object_id": 7,
      "category": "plant",
      "attributes": [
        "tall",
        "slender",
        "elongated",
        "vibrant green",
        "dense",
        "sparse",
        "vertical",
        "intricate",
        "subtle",
        "fan-like"
      ]
    },
    {
      "object_id": 8,
      "category": "light fixture (uncertain)",
      "attributes": [
        "glowing",
        "intricate",
        "futuristic",
        "lattice-like",
        "soft",
        "warm",
        "delicate",
        "three-dimensional",
        "consistent",
        "mesmerizing"
      ]
    },
    {
      "object_id": 9,
      "category": "flowerpot (uncertain)",
      "attributes": [
        "dark",
        "rectangular",
        "smooth",
        "solid",
        "deep",
        "rich color",
        "matte",
        "sharply defined edges"
      ]
    },
    {
      "object_id": 10,
      "category": "street light",
      "attributes": [
        "sleek",
        "modern",
        "distinctive",
        "angular",
        "geometric",
        "cohesive",
        "aerodynamic",
        "bright",
        "warm",
        "translucent",
        "evenly diffused"
      ]
    },
    {
      "object_id": 11,
      "category": "light fixture (uncertain)",
      "attributes": [
        "geometric-shaped",
        "sleek",
        "elongated",
        "angular",
        "lattice-like",
        "smooth",
        "reflective",
        "warm",
        "golden",
        "vibrant",
        "luminous",
        "open structure"
      ]
    },
    {
      "object_id": 12,
      "category": "door (uncertain)",
      "attributes": [
        "smooth",
        "reflective",
        "dark",
        "glossy",
        "rectangular",
        "sleek",
        "uniform color",
        "polished finish"
      ]
    },
    {
      "object_id": 13,
      "category": "bush",
      "attributes": [
        "lush",
        "vibrant",
        "dense",
        "rich green hue",
        "subtle hints of yellow",
        "rounded",
        "slightly irregular shape",
        "texture",
        "depth"
      ]
    },
    {
      "object_id": 14,
      "category": "plant",
      "attributes": [
        "long",
        "slender",
        "green and yellow hues",
        "slightly curved",
        "dense",
        "intricate pattern",
        "elegant",
        "natural beauty"
      ]
    },
    {
      "object_id": 15,
      "category": "plant",
      "attributes": [
        "lush",
        "verdant",
        "broad",
        "vibrant",
        "rich",
        "textured",
        "healthy",
        "robust",
        "full",
        "intricate",
        "dense",
        "subtle yellow and brown hints",
        "green hues",
        "veined"
      ]
    },
    {
      "object_id": 16,
      "category": "crossbar (uncertain)",
      "attributes": [
        "long",
        "dark",
        "rectangular",
        "smooth",
        "uniform",
        "solid",
        "sturdy",
        "straight-edged",
        "well-defined",
        "precise"
      ]
    },
    {
      "object_id": 17,
      "category": "flower arrangement",
      "attributes": [
        "deep purple",
        "tall",
        "vibrant",
        "densely packed",
        "velvety",
        "full",
        "green",
        "dark hues",
        "intricate details"
      ]
    },
    {
      "object_id": 18,
      "category": "plant",
      "attributes": [
        "lush",
        "vibrant green",
        "dense",
        "broad",
        "glossy",
        "deep green",
        "rich",
        "slightly glossy",
        "robust",
        "striking"
      ]
    },
    {
      "object_id": 19,
      "category": "flowerpot",
      "attributes": [
        "large",
        "sturdy",
        "smooth",
        "rounded",
        "subtle sheen",
        "ceramic or plastic material",
        "uniform appearance",
        "faint, irregular patches of discoloration",
        "slightly flared rim",
        "cylindrical shape"
      ]
    },
    {
      "object_id": 20,
      "category": "flowerpot",
      "attributes": [
        "smooth",
        "curved",
        "rounded rim",
        "subtle sheen",
        "ceramic or porcelain",
        "unadorned",
        "consistent shape",
        "broad",
        "stable base"
      ]
    },
    {
      "object_id": 21,
      "category": "flowerpot (uncertain)",
      "attributes": [
        "dark",
        "elongated",
        "smooth",
        "curved",
        "sleek",
        "glossy",
        "subtle sheen",
        "ceramic",
        "polished",
        "lighter-colored band",
        "uniform",
        "rounded"
      ]
    },
    {
      "object_id": 22,
      "category": "flowerpot (uncertain)",
      "attributes": [
        "smooth",
        "curved",
        "rounded",
        "subtle sheen",
        "ceramic",
        "polished",
        "uniform surface",
        "slightly reflective",
        "light catching",
        "solid"
      ]
    },
    {
      "object_id": 23,
      "category": "flowerpot",
      "attributes": [
        "smooth",
        "rounded",
        "gentle curve",
        "subtle sheen",
        "ceramic or polished plastic material",
        "soft, muted color",
        "white or light gray",
        "glossy appearance",
        "consistent shape",
        "wide, open top",
        "slightly tapered towards the base",
        "stable and sturdy design"
      ]
    },
    {
      "object_id": 24,
      "category": "flowerpot",
      "attributes": [
        "white",
        "smooth",
        "rounded",
        "tapered",
        "glossy",
        "clean",
        "simple",
        "medium size"
      ]
    },
    {
      "object_id": 25,
      "category": "flowerpot",
      "attributes": [
        "white",
        "rounded",
        "smooth",
        "slightly glossy",
        "clean",
        "polished finish",
        "slightly irregular rim"
      ]
    },
    {
      "object_id": 26,
      "category": "window",
      "attributes": [
        "tall",
        "rectangular",
        "dark-framed",
        "smooth",
        "reflective",
        "grid-like-patterned",
        "vertical-barred",
        "horizontal-barred",
        "clean-lined",
        "minimalist-designed"
      ]
    },
    {
      "object_id": 27,
      "category": "flowerpot (uncertain)",
      "attributes": [
        "dark",
        "elongated",
        "smooth",
        "curved",
        "cylindrical",
        "matte",
        "vertical"
      ]
    },
    {
      "object_id": -1,
      "category": "camera",
      "attributes": []
    }
  ]
}