{
  "activity_differential": [
    "camera traversing busy street market",
    "people shopping and walking in market",
    "motorcycle moving through crowded street"
  ],
  "description": "A moving camera (likely mounted on a motorcycle) traverses a busy street market, passing by motorcycles, people, vendors, and various market activities. The camera advances forward, capturing the dynamic interactions of people shopping, walking, and riding motorcycles.",
  "place_env_id_name": "street market",
  "relationship_filter_metadata": [
    {
      "decision": "drop",
      "explanation": "The object entity lacks a name or description, so it's impossible to determine if being 'adjacent to' the motorcycle is semantically or physically plausible.",
      "label": "insufficient_object_info",
      "object_id": 6,
      "predicate": "adjacent to",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "Physically, the dashboard is in front of the motorcycle from the rider's perspective, not the other way around. Flipping the subject and object makes the spatial relationship plausible.",
      "label": "flipped",
      "object_id": 5,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship lacks a name and description, so it's unclear what the 'dashboard' is 'in front of.' Without a defined object, this spatial relationship is not valid.",
      "label": "missing_object",
      "object_id": 6,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for the dashboard to be behind the motorcycle from an external viewpoint, as the dashboard is typically located within or behind the frame of the motorcycle.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'adjacent to' is spatially plausible given that the subject (object_id 6) is next to a clearly described motorcycle (object_id 4) in the scene, and there are no conflicting details.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "adjacent to",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "The subject's name and description are missing, making it impossible to judge plausibility or correctly interpret the spatial relationship 'behind' in this context.",
      "label": "insufficient_subject_info",
      "object_id": 5,
      "predicate": "behind",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be overlapping a jersey, especially considering both are soft, flexible items and may come into close contact during movement.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "overlapping",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a translucent plastic bag to overlap with the side of a motorcycle, especially if the bag is moving and possibly brushing against or partially covering the motorcycle's surface.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "overlapping",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name and any descriptive information, making it impossible to evaluate the plausibility of the 'below' spatial relationship.",
      "label": "missing_object_information",
      "object_id": 7,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a lightweight, moving plastic bag to be below a stationary, mounted signboard in a scene. The spatial relationship 'below' fits the described scenario without contradiction.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and physically common for a plastic bag to be below a large tree, such as when the bag is on the ground under the tree's canopy.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "Spatial relationships like 'right of' can apply between a described subject and an unspecified object, as long as their spatial arrangement is supported by the data. The lack of object attributes does not render the relation invalid.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The object lacks sufficient information (name, attributes, or description), making it impossible to evaluate the spatial plausibility of 'below'.",
      "label": "incomplete_object",
      "object_id": 13,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "It is highly unlikely for a plastic bag to be below a stationary signboard, especially when the bag is moving and the signboard remains stationary and elevated.",
      "label": "physically_implausible",
      "object_id": 14,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a crumpled, fluttering plastic bag to be spatially located below a stationary, mounted signboard. The descriptions support this vertical arrangement, making the 'below' relationship reasonable.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The object has no name, description, attributes, or actions, so spatial assessment of 'below' cannot be made.",
      "label": "insufficient_object_info",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible spatially for a plastic bag to be to the right of a person in a scene. The subject and object are appropriately assigned.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be below a signboard, especially given the bag's movement behaviors and the usual elevated position of a signboard.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and common for a plastic bag to be below a standing person, especially since the bag is described as moving, possibly on the ground or lower in the visual frame. There is no indication in the metadata that would render this spatial relationship impossible or unusual.",
      "label": "reasonable",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be below a signboard, especially considering the bag's movement and the stationary nature of the signboard.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "The plastic bag can reasonably be described as 'below' another (unspecified) object, especially given its position is likely changing or low due to motion. No information contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a light pink jersey to be overlapping a motorcycle, such as if someone wearing the jersey is sitting on or leaning against the motorcycle. The predicate 'overlapping' is used reasonably here, given typical scene graph conventions.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "overlapping",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object is unspecified (name, attributes, description are all null or empty), so the spatial predicate 'below' cannot be meaningfully evaluated or validated.",
      "label": "insufficient_object_context",
      "object_id": 7,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and contextually reasonable for a jersey (worn by a person) to be below a large signboard, as signboards are typically mounted above human height.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a jersey (likely being worn by a person) to be below a tree (which is large and stationary) than the tree being below the jersey. The subject and object should be swapped.",
      "label": "flipped",
      "object_id": 10,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object entity lacks a name and attributes, making the spatial 'right of' relationship unverifiable or incomplete.",
      "label": "object_missing",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object has no name or description, making it impossible to evaluate the plausibility of the 'below' relationship with the jersey.",
      "label": "missing_object_info",
      "object_id": 13,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "It is highly unlikely for a jersey being worn and moving fluidly to be spatially below a stationary signboard. Typically, a signboard is mounted above a person or object, especially in public or commercial spaces.",
      "label": "physically_implausible",
      "object_id": 14,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that a signboard is above a jersey (worn by a person walking beneath it) rather than a jersey being above a fixed signboard. Flipping the relationship makes the spatial arrangement appropriate.",
      "label": "flipped",
      "object_id": 16,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object in this relationship is unidentified (no name or description), making it impossible to evaluate whether a 'jersey' is below it.",
      "label": "insufficient_information",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and commonly accurate for a jersey (particularly one being worn) to be spatially described as 'right of' a person in a video context, for example, if it's worn by a different person to the right of the referenced person, or hanging/placed to the right.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a jersey (worn by a person) to be below a signboard (which is typically mounted above eye level), so flipping the subject and object yields a correct spatial relation: signboard below jersey becomes jersey below signboard.",
      "label": "flipped",
      "object_id": 19,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a jersey (being worn) to be below a person, for example if the jersey refers to a lower piece of clothing or a bag carried below the person; the descriptor does not provide contradictory spatial information.",
      "label": "reasonable",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a signboard to be physically above a jersey (e.g., someone wearing a jersey walking under a signboard). Therefore, flipping the subject and object corrects the spatial relationship.",
      "label": "flipped",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name or meaningful attributes, making it impossible to verify if the jersey is below it; relationship cannot be evaluated.",
      "label": "unverifiable_subject_object",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name or descriptive metadata, making the 'below' relationship uninformative and unverifiable.",
      "label": "uninformative_object",
      "object_id": 7,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "A signboard is typically positioned above a motorcycle, not below it. Flipping the subject and object makes the relationship ('signboard below motorcycle') plausible.",
      "label": "flipped",
      "object_id": 8,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a motorcycle (or its side) to be below a large tree, as trees are typically tall and can often be situated above vehicles that are parked or passing beneath them.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "The object has no name or descriptive information, making it impossible to validate or plausibly assess the spatial relationship 'right of' between the subject (motorcycle) and this object.",
      "label": "insufficient_object_info",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship is unspecified (null name and description), making it impossible to evaluate the spatial 'below' relationship.",
      "label": "object_unknown",
      "object_id": 13,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and physically common for a motorcycle to be below a signboard that remains stationary and elevated, such as a street or shop sign.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a motorcycle (even with uncertainty) to be below a stationary signboard, especially as signboards are typically mounted above vehicles or on posts. The spatial relationship fits.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship is not identified; without knowing what the subject is 'below', the spatial relationship is not meaningful or verifiable.",
      "label": "unknown_object",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and reasonable that a motorcycle (or its side) is positioned to the right of a person, especially given the scene's descriptions where locations and interactions are not contradictory.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and semantically coherent for a motorcycle (particularly its side or lower part) to be below a signboard.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a person to be below a motorcycle rather than a motorcycle being below a person, especially considering the typical scene structure in which motorcycles are above the ground and people may be next to or slightly below them.",
      "label": "flipped",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that a signboard with motorcycle images is above a physical motorcycle rather than a motorcycle being below a signboard. Flipping the subject and object corrects this spatial relationship.",
      "label": "flipped",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "A subject described as part of a motorcycle is below another unspecified object. Since the object label is unknown but the spatial predicate is plausible, the relationship is reasonable with the given information.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'subject is right of signboard' is spatially plausible; without names or more visual details for the subject, there is no reason to doubt the validity based on the given metadata.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'right of' is plausible for most object types, even when the subject's name is unknown. The tree's detailed description does not contradict this spatial relationship; as long as the subject (object_id 7) is positioned to the right of the tree, the statement is reasonable.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The subject (object_id 7) is described as being 'left of' the signboard, which is plausible for spatial relationships, even without additional detail about the subject.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The 'left of' spatial predicate commonly describes positional relationships, and there is nothing implausible about a visually uncertain subject being to the left of a signboard. The description of the signboard and its stationary characteristic does not preclude another object being to its left.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'below' is plausible between two unspecified objects; there is no indication this relationship is physically or semantically impossible.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for an unidentified object (subject) to be below a person who is described as standing upright. The 'below' spatial relationship makes sense given the person's upright posture.",
      "label": "reasonable",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "The subject object (ID 7) lacks a name, description, or attributes, making it impossible to evaluate the plausibility of the 'below' spatial relationship with the described signboard.",
      "label": "insufficient_context",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "Without more context about the objects involved, the spatial predicate 'below' is physically plausible and common, so the relationship can be kept as is.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "A signboard being to the right of a tree is spatially plausible and matches the scene metadata descriptions. The directions make sense and there's no indication that the relationship should be flipped or dropped.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one signboard to be spatially left of another signboard, and both objects are described distinctly.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'signboard left of signboard (uncertain)' is plausible based on their descriptions as stationary, mounted objects which may easily be spatially adjacent; the predicate 'left of' is meaningful and there is no indication to suggest it should be reversed.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship has no name, attributes, or description, making it impossible to evaluate the spatial predicate 'below' between the signboard and the unnamed entity.",
      "label": "insufficient_context",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "It is much more plausible for a person to be below a signboard (e.g., standing under it on the ground) than for a signboard to be below a person. Flipping the relationship corrects the spatial logic.",
      "label": "flipped",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one signboard to be located below another, especially if they are mounted on the same structure or facade. No semantic or physical contradictions are evident in the relationship.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship lacks a name and description, making it impossible to judge the plausibility of 'signboard below object.'",
      "label": "insufficient_object_info",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a large tree to be positioned to the left of a signboard; nothing in the descriptions contradicts this relationship.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for a large tree to be to the left of a signboard in a scene. No evidence suggests the relationship is incorrect or needs to be flipped.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "drop",
      "explanation": "The object is not identified (name is null), making it impossible to evaluate the plausibility of the tree being 'below' it.",
      "label": "incomplete_object",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "It is much more plausible for a person to be below a large tree than for a tree to be below a person, given the size and typical spatial arrangement.",
      "label": "flipped",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "flip",
      "explanation": "Signboards are typically placed below trees in outdoor scenes, not the reverse. 'Tree below signboard' is semantically unlikely, but 'signboard below tree' is plausible.",
      "label": "flipped",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name, attributes, or description, so it's impossible to evaluate the spatial 'below' relationship with the tree.",
      "label": "insufficient_object_context",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "The 'left of' spatial relationship is generic and plausible between two unspecified objects; no additional details conflict with this spatial orientation.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for an object (possibly a person or another item) to be 'left of' a signboard in a scene; no information contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "drop",
      "explanation": "The subject has no name, description, or distinguishing attributes, so its spatial relationship to the specified signboard cannot be meaningfully evaluated.",
      "label": "insufficient_subject_info",
      "object_id": 19,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one signboard to be 'left of' another signboard in a spatial scene, and nothing in the subject or object descriptions contradicts this.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "drop",
      "explanation": "The object involved in the relationship lacks a name and description, making it impossible to assess whether the 'below' spatial relationship with the signboard is reasonable.",
      "label": "insufficient_information",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that a signboard is above a person rather than below, as signs are typically mounted higher for visibility, while people stand beneath them.",
      "label": "flipped",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one signboard to be positioned below another signboard in a scene, especially if there are multiple adjacent signboards displayed vertically.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "drop",
      "explanation": "The object is unidentified and lacks description, making it impossible to validate the spatial 'below' relationship with the signboard.",
      "label": "insufficient_information",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 14
    },
    {
      "decision": "drop",
      "explanation": "The object lacks sufficient identification or descriptive information to validate whether the 'signboard' is below it. Relationship cannot be assessed with missing object details.",
      "label": "insufficient_object_info",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a person to be positioned below a signboard in a physical environment, especially as the signboard is described as mounted and stationary.",
      "label": "reasonable",
      "object_id": 20,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "drop",
      "explanation": "Both the subject and object are described as signboards, but neither description provides clear evidence that one is physically below the other. Without more explicit spatial context or distinguishing details, this 'below' relationship is ambiguous or potentially redundant.",
      "label": "redundant_or_ambiguous",
      "object_id": 21,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'below' is plausible, as a signboard can be positioned below another object. The lack of description for the object does not provide evidence to contradict the spatial relationship.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 16
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'left of' is plausible between an unspecified subject (object_id 17) and a person as described. There is no provided information contradicting the spatial arrangement, so the relation can be kept.",
      "label": "reasonable",
      "object_id": 20,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for an (unspecified) subject to be spatially 'left of' a signboard within a scene. No semantic or physical contradiction is present based on the metadata provided.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'left of' is plausible as a relationship, even without knowing the specific object types, as long as the referenced objects exist in the scene.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 17
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a person to be left of a plastic bag, especially as both are in motion and presumably in view of one another within a scene. The relationship makes sense given the provided context.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a person to be left of a jersey in a spatial context, especially if the jersey is worn or nearby. There is nothing in the descriptions to contradict this spatial relationship.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and semantically sensible for a person to be 'left of' a motorcycle in a spatial context. There is no indication from the metadata that this relationship is impossible or should be reversed.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 18
    },
    {
      "decision": "drop",
      "explanation": "The object does not have a name, description, or attributes, so it is impossible to assess the plausibility of this 'right of' spatial relationship.",
      "label": "insufficient_information",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and typical for a signboard, especially one attached to a storefront or post, to be physically above a plastic bag (which is often on or near the ground or drifting in the air). The relationship 'above' here fits common spatial arrangements.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a signboard to be physically above a jersey (likely worn by a person walking below). This spatial relationship makes sense and fits common visual arrangements in public spaces.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a signboard to be positioned above a motorcycle, especially in an urban or commercial setting where signboards are typically elevated and vehicles may be parked or passing below.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'right of' can plausibly relate a person and a signboard. It is common to describe the position of a person in relation to a signboard, so the relationship as stated is reasonable.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 20
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship is undefined, so it's impossible to reliably determine spatial relationships or validity.",
      "label": "ambiguous_object",
      "object_id": 22,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 20
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'right of' is spatial and generally applicable. Without information about the object, but no contradiction evident, the relationship is plausible and cannot be disproven with the given metadata.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 21
    },
    {
      "decision": "drop",
      "explanation": "A dashboard cannot 'move forward with' another object; it is a fixed part of the motorcycle and not an independent moving entity. Furthermore, the subject is undefined, making the relationship nonsensical.",
      "label": "physically_impossible",
      "object_id": 5,
      "predicate": "moving forward with",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "drop",
      "explanation": "The subject is missing (null name and id -1), so the relationship cannot be meaningfully evaluated or kept.",
      "label": "missing_subject",
      "object_id": 13,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'camera focusing on' logically fits the scenario where the (implied) subject is a camera and the object is a signboard. It is plausible and semantically correct for a camera to focus on a signboard in a video context.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for the camera to be focusing on the wall, especially as the wall is described as a prominent object in the scene. The predicate 'camera focusing on' is appropriately directed from the camera (implicit subject) to the wall (object).",
      "label": "reasonable",
      "object_id": 23,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "A camera focusing on a woman is a plausible attentional relationship in video scene graphs; the undefined camera subject is standard for observer relationships.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name, description, or identifying attributes, making the relationship incomplete and unverifiable. Cannot evaluate plausibility without knowing what the dashboard is attached to.",
      "label": "missing_object",
      "object_id": 6,
      "predicate": "dashboard attached to",
      "relation_type": "functional",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is semantically plausible for a dashboard to be 'moving together with' the motorcycle, as the dashboard is a part of the motorcycle. The relationship accurately captures their joint movement.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "moving together with",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "A dashboard, being a stationary part of a motorcycle, cannot 'pass by' another object; it moves only as part of the entire vehicle. The relationship as stated is not physically plausible.",
      "label": "physically_impossible",
      "object_id": 13,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and semantically correct for a motorcycle dashboard (as part of the moving motorcycle) to be passing by a stationary signboard, matching typical real-world scenarios in motion scenes.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "A dashboard is a fixed part of a motorcycle and cannot 'pass by' a stationary wall; the motion predicate does not make sense here as described.",
      "label": "physically_implausible",
      "object_id": 23,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible that the woman (who is walking) is approaching the dashboard, rather than the dashboard (an inanimate object) approaching the woman.",
      "label": "flipped",
      "object_id": 37,
      "predicate": "approaching",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "A signboard cannot engage in 'walking with' another entity, as it is an inanimate, stationary object. The relationship is physically implausible.",
      "label": "physically_impossible",
      "object_id": 19,
      "predicate": "walking with",
      "relation_type": "social",
      "subject_id": 13
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for an unspecified subject (possibly a person or animal) to be walking near a wall. The relationship makes sense semantically and physically.",
      "label": "reasonable",
      "object_id": 23,
      "predicate": "walking near",
      "relation_type": "motion",
      "subject_id": 13
    },
    {
      "decision": "drop",
      "explanation": "The predicate 'walking near' requires the subject to be capable of motion, but a signboard is a stationary object and cannot perform the action 'walking', making the relationship physically impossible.",
      "label": "physically_impossible",
      "object_id": 23,
      "predicate": "walking near",
      "relation_type": "motion",
      "subject_id": 19
    },
    {
      "decision": "drop",
      "explanation": "A sari is an inanimate object of clothing and cannot 'walk with' anyone; this predicate is only plausible for animate beings. The subject is unspecified, but the object being a sari makes the relationship invalid.",
      "label": "category_mismatch",
      "object_id": 15,
      "predicate": "walking with",
      "relation_type": "social",
      "subject_id": 13
    },
    {
      "decision": "drop",
      "explanation": "A signboard and a sari cannot participate in the social action 'walking with'; neither is an animate agent capable of walking.",
      "label": "physically_impossible",
      "object_id": 15,
      "predicate": "walking with",
      "relation_type": "social",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'walking near' is a plausible motion relationship between two unspecified objects, so it is reasonable to keep it even without further subject or object details.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "walking near",
      "relation_type": "motion",
      "subject_id": 13
    },
    {
      "decision": "drop",
      "explanation": "A signboard typically does not walk, nor can it move near anything. The relationship 'walking near' is not plausible when the subject is a stationary signboard.",
      "label": "physically_impossible",
      "object_id": 39,
      "predicate": "walking near",
      "relation_type": "motion",
      "subject_id": 19
    },
    {
      "decision": "drop",
      "explanation": "A dashboard cannot 'pass by' a person; dashboards are fixed parts of vehicles, while the person is mobile. The relationship is not physically plausible given the subject and object.",
      "label": "physically_impossible",
      "object_id": 18,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship is undefined (null name and missing description), so evaluating 'dashboard passing by [object]' is not possible. The relationship lacks necessary information to be validated.",
      "label": "incomplete_object",
      "object_id": 24,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "A 'dashboard' is a stationary component of a motorcycle, while the 'woman' is moving. It is implausible for the dashboard to be 'passing by' the woman unless the perspective is from the motorcycle, which is not directly indicated. The semantics of 'passing by' do not fit well between a dashboard and a walking person.",
      "label": "physically_implausible",
      "object_id": 37,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "A dashboard (stationary within the motorcycle) cannot be described as 'passing by' an unknown object unless the dashboard itself is moving past a fixed point, which the context does not suggest. With the other object being unidentified, plausibility is low.",
      "label": "physically_impossible",
      "object_id": 39,
      "predicate": "passing by",
      "relation_type": "motion",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'walking near' is a plausible motion relationship between two unspecified objects, so it is reasonable to keep it even without further subject or object details.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "walking near",
      "relation_type": "motion",
      "subject_id": 13
    },
    {
      "decision": "drop",
      "explanation": "A signboard typically does not walk, nor can it move near anything. The relationship 'walking near' is not plausible when the subject is a stationary signboard.",
      "label": "physically_impossible",
      "object_id": 39,
      "predicate": "walking near",
      "relation_type": "motion",
      "subject_id": 19
    }
  ],
  "relationships": [
    [
      4,
      6,
      "adjacent to",
      [
        [
          0,
          24
        ],
        [
          384,
          384
        ]
      ],
      "spatial"
    ],
    [
      5,
      6,
      "in front of",
      [
        [
          0,
          24
        ],
        [
          384,
          384
        ]
      ],
      "spatial"
    ],
    [
      6,
      5,
      "behind",
      [
        [
          0,
          24
        ],
        [
          384,
          384
        ]
      ],
      "spatial"
    ],
    [
      1,
      7,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      13,
      "below",
      [
        [
          48,
          192
        ]
      ],
      "spatial"
    ],
    [
      1,
      14,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      1,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      7,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      11,
      "right of",
      [
        [
          48,
          96
        ]
      ],
      "spatial"
    ],
    [
      2,
      13,
      "below",
      [
        [
          48,
          216
        ]
      ],
      "spatial"
    ],
    [
      2,
      14,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      2,
      22,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      7,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      3,
      11,
      "right of",
      [
        [
          48,
          96
        ]
      ],
      "spatial"
    ],
    [
      3,
      13,
      "below",
      [
        [
          48,
          216
        ]
      ],
      "spatial"
    ],
    [
      3,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      7,
      21,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      8,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      8,
      22,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      10,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      10,
      22,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      13,
      19,
      "left of",
      [
        [
          48,
          288
        ]
      ],
      "spatial"
    ],
    [
      14,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      14,
      22,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      16,
      17,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      16,
      21,
      "below",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      19,
      13,
      "right of",
      [
        [
          48,
          288
        ]
      ],
      "spatial"
    ],
    [
      20,
      22,
      "right of",
      [
        [
          48,
          144
        ]
      ],
      "spatial"
    ],
    [
      -1,
      5,
      "moving forward with",
      [
        [
          0,
          384
        ]
      ],
      "motion"
    ],
    [
      -1,
      13,
      "camera focusing on",
      [
        [
          48,
          312
        ]
      ],
      "attentional"
    ],
    [
      5,
      6,
      "dashboard attached to",
      [
        [
          0,
          24
        ],
        [
          384,
          384
        ]
      ],
      "functional"
    ],
    [
      5,
      13,
      "passing by",
      [
        [
          48,
          312
        ]
      ],
      "motion"
    ],
    [
      5,
      23,
      "passing by",
      [
        [
          120,
          192
        ]
      ],
      "motion"
    ],
    [
      13,
      19,
      "walking with",
      [
        [
          48,
          288
        ]
      ],
      "social"
    ],
    [
      19,
      23,
      "walking near",
      [
        [
          120,
          192
        ]
      ],
      "motion"
    ],
    [
      13,
      15,
      "walking with",
      [
        [
          72,
          144
        ]
      ],
      "social"
    ],
    [
      19,
      15,
      "walking with",
      [
        [
          72,
          144
        ]
      ],
      "social"
    ],
    [
      19,
      39,
      "walking near",
      [
        [
          240,
          312
        ]
      ],
      "motion"
    ],
    [
      5,
      18,
      "passing by",
      [
        [
          48,
          120
        ]
      ],
      "motion"
    ],
    [
      5,
      24,
      "passing by",
      [
        [
          96,
          144
        ]
      ],
      "motion"
    ],
    [
      5,
      37,
      "passing by",
      [
        [
          288,
          384
        ]
      ],
      "motion"
    ],
    [
      5,
      39,
      "passing by",
      [
        [
          240,
          384
        ]
      ],
      "motion"
    ],
    [
      19,
      39,
      "walking near",
      [
        [
          240,
          312
        ]
      ],
      "motion"
    ]
  ],
  "video_id": "sav_000013",
  "drop_relationships_only": true,
  "drop_relationships_missing_spans": []
}