{
  "activity_differential": [
    "people dining together at an outdoor event",
    "people conversing and socializing at a communal table",
    "people listening to music or announcements from a speaker"
  ],
  "description": "A nighttime outdoor event with people sitting on chairs at a table, a speaker setup, blankets and mats on the ground, and various bags and objects scattered. The camera moves around the area, capturing people eating, sitting, and interacting in a communal setting.",
  "place_env_id_name": "outdoor event space",
  "relationship_filter_metadata": [
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket (even if crumpled) to be on top of a doormat given their respective descriptions and attributes, and the relationship does not contradict typical physical arrangements.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be right of a plastic bag in a scene. Both are physical objects with no inherent spatial contradiction in this relationship.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be spatially located to the right of a mat; the relationship is physically and semantically valid given the provided descriptions of both objects.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be above a plastic bag, especially given both are lightweight fabric-like objects. There is nothing physically or semantically wrong with this spatial relationship.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket (or fabric) to be spatially situated to the left of another fabric-like object; no contradictions in physical arrangement or attributes.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be spatially positioned to the left of a plastic bag, especially since both objects are described as soft and lightweight, and no contradictory spatial details are given.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be spatially located to the right of a pipe, and nothing in the attributes or actions contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible that a blanket could be to the right of a stone in a scene. The spatial relationship described is physically possible and semantically coherent given the provided descriptions.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be positioned to the right of a napkin in a scene. The spatial relationship 'right of' makes sense given the objects described.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'right of' is plausible between a blanket (which is lying on a surface) and a long, rectangular object. The descriptions suggest they are distinct items and their spatial arrangement could reasonably be described in such terms.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "A blanket being to the right of a person is physically and semantically plausible, especially in an indoor setting where both may be present.",
      "label": "reasonable",
      "object_id": 26,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a blanket to be above a chair (e.g., draped over the chair), and the metadata descriptions do not contradict this spatial relationship.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a blanket (even if uncertain) to be spatially 'left of' a statue in a scene. The spatial predicate fits the context, regardless of their attributes or actions.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be positioned to the right of a person, especially given the context of a stationary person and a nearby piece of fabric. There is no physical or semantic impossibility.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be spatially left of a stationary box. The metadata supports both objects' presence and orientation, making the 'left of' relationship reasonable.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket (even if uncertain) to be spatially right of a pole, and both objects' descriptions do not conflict with this spatial relationship.",
      "label": "reasonable",
      "object_id": 23,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a blanket (possibly outdoors or near a window) to be to the right of a tree within a scene, especially given the relationship only expresses relative position, not contact or physical dependency.",
      "label": "reasonable",
      "object_id": 24,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a blanket to be to the right of a piece of cardboard, and there is nothing in the descriptions to suggest this spatial relationship is incorrect.",
      "label": "reasonable",
      "object_id": 25,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "Both the subject and object are distinct plastic bags with different physical descriptions. The 'left of' spatial relationship can plausibly describe their relative positions in the scene, making the relationship reasonable to keep.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a plastic bag to be 'left of' a mat in a scene, as this spatial relationship is plausible given the physical nature and placement of the described objects.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a 'plastic bag' to be spatially 'left of' a 'doormat' in a scene. The attributes and actions do not contradict this spatial arrangement and both objects are described as being relatively stationary.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a plastic bag to be left of a fabric-like object. The descriptions and attributes do not contradict this spatial relation, and both objects could logically co-occur in these positions.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one plastic bag to be spatially 'left of' another, even if both are similar in appearance. The spatial relation is not physically impossible or redundant.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a plastic bag to be 'left of' a pipe in a scene; nothing in the descriptions contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be located to the left of a stone, and nothing about the attributes or described actions contradicts the spatial relationship 'left of.'",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'plastic bag left of napkin (uncertain)' is plausible given both are lightweight objects commonly found near each other, and there is nothing physically impossible or redundant about this arrangement.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'left of' is plausible between a plastic bag and a long, rectangular object, as described, with no semantic or physical conflict based on the provided details.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a plastic bag to be to the left of a person; there is no evidence this spatial relationship is incorrect based on the descriptions provided.",
      "label": "reasonable",
      "object_id": 26,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be below a chair, such as on the floor underneath or beside it. The attributes and descriptions do not contradict this spatial relationship.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a plastic bag to be left of a statue. There are no contradictions or illogical implications in this spatial relationship.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a plastic bag to be right of a person, especially as both are described as relatively stationary in the scene.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a plastic bag to be left of a box. The description supports both objects being stationary, so the spatial relationship 'left of' is reasonable.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'plastic bag right of pole (uncertain)' is spatially plausible, and there is no contradiction in the subject being to the right of the object. The descriptions do not indicate any impossibility or redundancy.",
      "label": "reasonable",
      "object_id": 23,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "A plastic bag can physically be to the right of a tree in a scene. The relationship 'right of' makes sense spatially and is plausible given the subjects involved.",
      "label": "reasonable",
      "object_id": 24,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a plastic bag to be to the right of a piece of cardboard in a video scene. No semantic or physical conflict exists in this spatial relationship.",
      "label": "reasonable",
      "object_id": 25,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a doormat to be 'right of' a plastic bag in a spatial sense, as both are objects that can exist next to each other on the ground. The relationship is clear and reasonable based on their descriptions.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be spatially 'right of' another mat, especially as both appear to be mats placed on the ground. There are no semantic or physical conflicts in this relationship.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a doormat to be right of a fabric-like object given no contradictory physical or spatial details in the metadata.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a doormat to be right of a plastic bag in a scene; the predicate 'right of' describes a valid spatial relationship given the stationary nature of the doormat and the described attributes of both objects.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a doormat to be to the right of a pipe in a scene, and both objects remain stationary according to their descriptions, making the spatial relationship plausible.",
      "label": "reasonable",
      "object_id": 13,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be to the right of a stone, as no spatial or physical constraints are violated and the predicate 'right of' makes sense with these objects.",
      "label": "reasonable",
      "object_id": 14,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be spatially 'right of' a napkin (or napkin-like object) in a scene. The doormat is stationary and the napkin is mobile, but this does not affect the spatial relationship described. The relationship is semantically and physically reasonable.",
      "label": "reasonable",
      "object_id": 15,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The doormat being 'right of' a long, rectangular object is spatially plausible based on the descriptions, and there's no conflict in attributes or actions to dispute the relationship.",
      "label": "reasonable",
      "object_id": 16,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be to the right of a person in a spatial layout, and nothing in the provided descriptions makes this physically or semantically implausible.",
      "label": "reasonable",
      "object_id": 26,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a doormat to be below a chair, as doormats are placed on the floor and chairs are often positioned on or above them.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "below",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be to the right of a statue in a spatial layout. The relationship aligns well with the physical positions that these objects might have relative to each other.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be spatially 'left of' a person, as both objects can be positioned next to each other in such a manner. No additional context contradicts this spatial arrangement.",
      "label": "reasonable",
      "object_id": 21,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a doormat to be right of a box, given their described attributes and stationary positioning. Nothing in their descriptions makes this relationship physically or situationally impossible.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be left of a pole in a scene, and both objects are described as remaining stationary, making the spatial relationship accurate and reasonable.",
      "label": "reasonable",
      "object_id": 23,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a doormat to be 'left of' a tree within a scene, and the spatial relationship makes sense given the provided descriptions.",
      "label": "reasonable",
      "object_id": 24,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "A doormat being to the left of a piece of cardboard is spatially plausible and semantically reasonable given both objects are flat and likely lying adjacent on the ground.",
      "label": "reasonable",
      "object_id": 25,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'camera panning toward' plausibly describes a camera movement relative to the blanket, with the camera as the understood subject. The use of a null subject communicates the camera's viewpoint, which is a common convention in scene graph annotation.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "camera panning toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'camera panning toward box' is reasonable, as it describes a camera motion relative to a stationary object, which matches the described scene details.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "camera panning toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a camera (subject, possibly unspecified in metadata) to be focusing on a flag (object); the predicate matches typical video scene graph semantics.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is common to describe a camera panning toward an object, especially when the subject is unspecified (represented here by null). The relationship is plausible and semantically valid in a video context.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "camera panning toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for the camera to be panning toward a stationary statue; this is a common videographic action. The subject is the (unspecified) camera moving toward the object (statue), which is semantically reasonable.",
      "label": "reasonable",
      "object_id": 18,
      "predicate": "camera panning toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for a camera to tilt down toward a plastic bag; this is consistent with common filming techniques and matches the provided metadata.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "camera tilting down toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically reasonable for a (possibly unmentioned) camera to focus on a box. The subject is unspecified, but in the context of attentional relationships, camera as an agent is implicit.",
      "label": "reasonable",
      "object_id": 22,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a person to be 'sitting on' a box than for a box to be 'sitting on' a person. The relationship direction was likely reversed.",
      "label": "flipped",
      "object_id": 3,
      "predicate": "sitting on",
      "relation_type": "functional",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "A stationary box cannot 'eat from' a stationary pole. Both objects are inanimate and do not perform eating actions, making this relationship implausible.",
      "label": "physically_impossible",
      "object_id": 23,
      "predicate": "eating from",
      "relation_type": "functional",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "Inanimate objects like a box and a speaker cannot engage in a social action such as 'conversing with'; the predicate is not plausible for these subjects and objects.",
      "label": "physically_impossible",
      "object_id": 4,
      "predicate": "conversing with",
      "relation_type": "social",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "A box and a chair leg cannot plausibly be 'conversing with' each other as both are inanimate objects incapable of social interaction.",
      "label": "physically_impossible",
      "object_id": 1,
      "predicate": "conversing with",
      "relation_type": "social",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "The 'sitting with' predicate describes a social interaction not plausible between a box and a statue; neither entity can participate in social actions like sitting.",
      "label": "implausible_social_relation",
      "object_id": 18,
      "predicate": "sitting with",
      "relation_type": "social",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "A speaker and a person cannot plausibly be 'sitting with' each other, as speakers do not sit, nor engage in social actions. The relationship is not semantically appropriate for these object categories.",
      "label": "physically_impossible",
      "object_id": 3,
      "predicate": "sitting with",
      "relation_type": "social",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "Speakers and boxes are inanimate objects and cannot engage in social behaviors such as 'conversing with.' The predicate is not applicable to these types of objects, making the relationship physically and semantically impossible.",
      "label": "physically_impossible",
      "object_id": 22,
      "predicate": "conversing with",
      "relation_type": "social",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "A chair leg and a box cannot engage in social conversation, making this relationship physically and semantically impossible.",
      "label": "physically_impossible",
      "object_id": 22,
      "predicate": "conversing with",
      "relation_type": "social",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A chair leg (even if uncertain) cannot socially 'sit with' a statue. The predicate 'sitting with' is intended for sentient beings or at least whole objects that can participate in sitting, not inanimate parts like chair legs and statues.",
      "label": "physically_impossible",
      "object_id": 18,
      "predicate": "sitting with",
      "relation_type": "social",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A chair leg cannot eat from a pole; both are inanimate objects incapable of the action 'eating from', making this relationship physically and semantically impossible.",
      "label": "physically_impossible",
      "object_id": 23,
      "predicate": "eating from",
      "relation_type": "functional",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A box being 'focused on' a pole does not make sense because inanimate objects like boxes do not direct attention. The predicate 'focused on' is only meaningful for agents capable of attention.",
      "label": "semantically_unclear",
      "object_id": 23,
      "predicate": "focused on",
      "relation_type": "attentional",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "It is not plausible or meaningful for a 'chair leg' to be 'focused on' a 'pole', as neither object can possess attention. The predicate is not applicable to these inanimate objects.",
      "label": "physically_implausible",
      "object_id": 23,
      "predicate": "focused on",
      "relation_type": "attentional",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A box cannot 'listen to' a blanket; inanimate objects without sensory mechanisms cannot perform the action of listening, making this relationship implausible.",
      "label": "physically_impossible",
      "object_id": 5,
      "predicate": "listening to",
      "relation_type": "functional",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "A chair leg cannot 'listen to' a blanket; neither object possesses sensory capabilities for listening, making the relationship implausible.",
      "label": "physically_impossible",
      "object_id": 5,
      "predicate": "listening to",
      "relation_type": "functional",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A speaker cannot listen to a blanket; this relationship is not physically or semantically plausible.",
      "label": "physically_impossible",
      "object_id": 5,
      "predicate": "listening to",
      "relation_type": "functional",
      "subject_id": 4
    },
    {
      "decision": "flip",
      "explanation": "It is more plausible for a plastic bag to rest its feet (or analogous part) on a box than for a box to rest its feet on a plastic bag, given their typical physical properties and behaviors.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "resting feet on",
      "relation_type": "functional",
      "subject_id": 22
    },
    {
      "decision": "flip",
      "explanation": "A chair leg cannot rest its feet on a plastic bag, but a plastic bag could plausibly be resting on a chair leg.",
      "label": "flipped",
      "object_id": 9,
      "predicate": "resting feet on",
      "relation_type": "functional",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A stationary box and statue cannot plausibly be described as 'dining with' each other. Neither object is animate or capable of dining, making this higher-order relationship implausible.",
      "label": "physically_implausible",
      "object_id": 18,
      "predicate": "dining with",
      "relation_type": "higher_order",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "A chair leg (even if uncertain) cannot be plausibly described as 'dining with' a statue, as neither are autonomous agents that can participate in the act of dining.",
      "label": "semantically_implausible",
      "object_id": 18,
      "predicate": "dining with",
      "relation_type": "higher_order",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "A stationary box cannot meaningfully 'dine with' a chair leg, which is an inanimate object, making this relationship physically and semantically implausible.",
      "label": "physically_impossible",
      "object_id": 1,
      "predicate": "dining with",
      "relation_type": "higher_order",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "The predicate 'dining with' implies social or animate agency, which neither a stationary speaker nor a statue possess. The relationship is not plausible given the described objects.",
      "label": "semantically_implausible",
      "object_id": 18,
      "predicate": "dining with",
      "relation_type": "higher_order",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "The predicate 'dining with' implies an animate, social interaction which does not semantically fit two inanimate objects like a box and a speaker.",
      "label": "semantically_incoherent",
      "object_id": 4,
      "predicate": "dining with",
      "relation_type": "higher_order",
      "subject_id": 22
    },
    {
      "decision": "drop",
      "explanation": "A 'chair leg' does not plausibly 'dine with' a 'speaker'; neither object is capable of dining, making this relationship semantically and physically nonsensical.",
      "label": "physically_impossible",
      "object_id": 4,
      "predicate": "dining with",
      "relation_type": "higher_order",
      "subject_id": 1
    }
  ],
  "relationships": [
    [
      22,
      23,
      "eating from",
      [
        [
          96,
          216
        ]
      ],
      "functional"
    ],
    [
      22,
      4,
      "conversing with",
      [
        [
          96,
          144
        ]
      ],
      "social"
    ],
    [
      22,
      1,
      "conversing with",
      [
        [
          96,
          144
        ]
      ],
      "social"
    ],
    [
      22,
      18,
      "sitting with",
      [
        [
          96,
          216
        ]
      ],
      "social"
    ],
    [
      4,
      3,
      "sitting with",
      [
        [
          48,
          72
        ]
      ],
      "social"
    ],
    [
      4,
      22,
      "conversing with",
      [
        [
          96,
          144
        ]
      ],
      "social"
    ],
    [
      1,
      22,
      "conversing with",
      [
        [
          96,
          144
        ]
      ],
      "social"
    ],
    [
      1,
      18,
      "sitting with",
      [
        [
          96,
          216
        ]
      ],
      "social"
    ],
    [
      1,
      23,
      "eating from",
      [
        [
          96,
          216
        ]
      ],
      "functional"
    ],
    [
      22,
      23,
      "focused on",
      [
        [
          96,
          216
        ]
      ],
      "attentional"
    ],
    [
      1,
      23,
      "focused on",
      [
        [
          96,
          216
        ]
      ],
      "attentional"
    ],
    [
      22,
      5,
      "listening to",
      [
        [
          96,
          240
        ]
      ],
      "functional"
    ],
    [
      1,
      5,
      "listening to",
      [
        [
          96,
          216
        ]
      ],
      "functional"
    ],
    [
      4,
      5,
      "listening to",
      [
        [
          48,
          144
        ]
      ],
      "functional"
    ],
    [
      22,
      18,
      "dining with",
      [
        [
          96,
          216
        ]
      ],
      "higher_order"
    ],
    [
      1,
      18,
      "dining with",
      [
        [
          96,
          216
        ]
      ],
      "higher_order"
    ],
    [
      22,
      1,
      "dining with",
      [
        [
          96,
          216
        ]
      ],
      "higher_order"
    ],
    [
      4,
      18,
      "dining with",
      [
        [
          96,
          144
        ]
      ],
      "higher_order"
    ],
    [
      22,
      4,
      "dining with",
      [
        [
          96,
          144
        ]
      ],
      "higher_order"
    ],
    [
      1,
      4,
      "dining with",
      [
        [
          96,
          144
        ]
      ],
      "higher_order"
    ]
  ],
  "video_id": "sav_000009",
  "drop_relationships_only": true,
  "drop_relationships_missing_spans": []
}