{
  "activity_differential": [
    "child catching and holding rooster",
    "child interacting with rooster in garden",
    "camera panning through farmyard and garden"
  ],
  "description": "A rooster is present in a fenced outdoor area with logs, poles, trees, and tarps. The camera pans from the rooster's enclosure to a garden area, where a child is later seen holding the rooster, likely after catching it. The child interacts with the rooster and green gloves, while the camera continues to move through the environment.",
  "place_env_id_name": "farmyard",
  "relationship_filter_metadata": [
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for a rooster to be standing on top of a log.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "standing on top of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be standing on top of a log, as birds often perch or stand on elevated objects like logs.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "standing on top of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be in front of a curtain, considering the rooster is likely in a position closer to the camera or observer and the curtain serves as a backdrop. The spatial relationship makes sense in both physical and semantic contexts.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a rooster to be to the right of a pole in the scene. Nothing in the description contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "A rooster standing or perched on top of a log is physically plausible and consistent with their behaviors in natural settings. The subject and object order is correct for the predicate 'on top of.'",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and semantically sensible for the rooster to be spatially positioned to the left of a log; nothing in the description contradicts this spatial arrangement.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be 'in front of' a rectangular block in a spatial relationship, as such ordering occurs commonly in real-world scenes.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be on top of a log, especially since the log is described as stable and the rooster is moving. Subject and object roles are correctly assigned for the spatial 'on top of' predicate.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "on top of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be under a tree, especially given that the tree is described as tall and broad-canopied, making this spatial relationship reasonable.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be left of a log in a scene, and the relationship respects spatial semantics. No evidence suggests the need to flip or drop the relation.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship is undefined, so it's impossible to evaluate if the rooster is 'under' it. The relationship lacks plausibility due to missing data.",
      "label": "unknown_object",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is common and physically plausible for a rooster to be positioned in front of a log in a spatial context; the description supports this possibility.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "flip",
      "explanation": "It is physically more plausible for a rooster to be under a pole than for a pole to be under a rooster, especially since the pole is described as upright and stationary.",
      "label": "flipped",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship does not have a name or description, making it impossible to validate the plausibility of the 'in front of' spatial relationship.",
      "label": "object_missing_name",
      "object_id": 37,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a rooster to be spatially 'left of' a tarp, and nothing in the description or attributes contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for two logs, regardless of orientation, to be touching each other, especially if both remain stationary and are described as proximal in a scene.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a log to be 'in front of' a curtain, given the spatial and physical attributes. The 'in front of' spatial relationship is reasonable with respect to the given descriptions.",
      "label": "reasonable",
      "object_id": 4,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "A log being left of a vertical pole is a plausible spatial relationship based on their described positions and orientations.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically reasonable for two logs to be touching, especially as their descriptions do not contradict spatial proximity or contact.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for one log to be left of another log—both objects could exist in the same scene with a clear spatial relation defined by 'left of', given their described positions and orientations.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "The statement 'log in front of block' is spatially plausible. Both are stationary objects, and there is no evidence to suggest the ordering is incorrect or needs to be flipped.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "Both objects are described as logs or log-like, and it is plausible for one log to be touching another, especially given the spatial relationship and their proximity implied in the scene.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a log to be under a tree, as logs often lie on the ground while trees stand upright. The spatial relationship 'under' in this context makes sense and matches expected physical arrangements.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'log left of log (uncertain)' is spatially plausible, especially as both objects are described as logs (or similar), and there is nothing in the metadata that makes this spatial relation impossible or redundant.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship is missing a name and description, making it impossible to evaluate if the log is under it. The relationship cannot be validated.",
      "label": "underspecified_object",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log to be in front of another log in a video scene, and there is no information contradicting the spatial relationship described.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "It is unlikely for a log to be under a pole that stands upright; typically, a vertical pole would be under or beside a log, not vice versa.",
      "label": "physically_implausible",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "drop",
      "explanation": "The object involved in the relationship has no name, attributes, or description, making it impossible to evaluate if 'touching' is plausible.",
      "label": "object_unknown",
      "object_id": 37,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a log to be 'left of' a tarp in a scene. There is no semantic or physical contradiction between the two objects and the predicate.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 3
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a curtain to be to the left of a log in a scene. The spatial relationship is reasonable based on the object descriptions.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a curtain to be 'left of' a pole; nothing in the descriptions contradicts this arrangement.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a curtain and a log to be side by side, and the relationship 'curtain (uncertain) left of log' is reasonable given their described vertical orientation and lack of contradictory details.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a curtain to be spatially described as 'left of' a log, as there is nothing physically or semantically implausible about this spatial relationship given the provided descriptions.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a curtain to be described as being 'left of' a block. The relationship makes sense contextually and does not contradict physical or semantic expectations.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a curtain to be to the left of a log. The relationship does not violate any physical or semantic constraints, and the objects' descriptions allow for such spatial arrangement.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a curtain (possibly near a window or door) to be positioned in front of a tree (as viewed from inside or outside a structure). The spatial relationship 'in front of' makes sense given the objects and their typical context.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'left of' between a curtain and a log is plausible, as both are elongated objects that can occupy different horizontal positions within the scene. There is no semantic or physical impossibility in the relationship.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "The object involved in the relationship is not identified or described, making it impossible to evaluate the plausibility of the 'in front of' spatial relation.",
      "label": "insufficient_object_info",
      "object_id": 19,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a curtain to be touching a log, especially if the log serves as a decorative or support element. The descriptions do not conflict with the 'touching' relationship.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and spatially plausible for a curtain (potentially moving in a breeze) to be in front of a stationary pole, such as a curtain in front of a support pole near a window or stage.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "drop",
      "explanation": "The object lacks sufficient information (no name or description) to validate the spatial relationship; thus, the relationship cannot be reliably assessed.",
      "label": "underdetermined_object",
      "object_id": 37,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a curtain to be to the left of a tarp, and both are vertically oriented, fabric-like objects exhibiting movement consistent with the scene. No semantic or physical contradiction is present.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 4
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a log to be spatially positioned left of a pole, given both objects are vertical and stationary in the scene. There is no indication the relationship is physically or semantically implausible.",
      "label": "reasonable",
      "object_id": 6,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and reasonable for two logs, especially in close proximity and both described as stationary, to be touching. No contradiction or implausibility is indicated by the descriptions.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "Both subject and object are logs (or resemble logs) that can occupy spatial positions relative to each other, and it is reasonable for one log to be left of another in a scene.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a log to be in front of a block, especially since both are stationary and their positions in the sequence remain unchanged. No physical impossibility or logical error is present.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a weathered, stationary log and a slender, log-like object to be touching, given their physical descriptions and similar characteristics. The predicate 'touching' is spatially reasonable between two logs.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "A log (especially standing upright) is extremely unlikely to be physically 'under' a tree, as trees are much taller and logs are typically on the ground. The described context makes this spatial relationship implausible.",
      "label": "physically_impossible",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "Spatial relationships like 'log left of log' are plausible as long as the scene contains multiple logs. The attributes and descriptions do not contradict this relationship, and there is no evidence that the subject and object should be flipped.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "The object does not have a name or description, making it impossible to judge if 'log under [object]' or vice versa is reasonable. Without this information, the relationship cannot be validated.",
      "label": "incomplete_object_info",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log to be 'in front of' another log, and there is no physical or semantic impossibility. The directionality of 'in front of' can apply, depending on the camera perspective or scene arrangement, so the relationship is valid.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "drop",
      "explanation": "Both the log and the pole are described as standing upright and stationary, making it implausible for the log to be under the pole in a typical spatial sense. The descriptions do not support one being above the other.",
      "label": "physically_impossible",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'touching' describes a plausible spatial relationship even though the object's details are missing; it's reasonable that the log is in contact with another unspecified object.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and semantically coherent for a log to be left of a tarp, given these two are spatially distinct objects. Nothing in the attributes or context contradicts the spatial relationship expressed.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 5
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pole to be spatially 'right of' a log in a scene, and both are described as stationary vertical objects, making the spatial relationship reasonable.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a pole to be described as 'right of' a log, especially in a scene where both objects are upright and present. The spatial relationship is plausible based on the descriptions.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pole to be described as 'right of' a block in a spatial relationship, given the scene's objects and the predicate used.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pole to be spatially to the right of a log; the spatial 'right of' relationship makes sense with the described objects.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "flip",
      "explanation": "Normally, a pole would not be under a tree; rather, it is more plausible for the tree (with its canopy) to be over the pole. Flipping the relationship makes it semantically reasonable—'tree under pole' is unlikely, but 'pole under tree' is plausible.",
      "label": "flipped",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pole to be right of a log in a scene. The spatial predicate 'right of' makes sense given no contradictory spatial information, and the objects' vertical, elongated forms support their co-occurrence and arrangement.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "The object has no name, attributes, or description, so it's impossible to judge the plausibility of the 'under' spatial relationship.",
      "label": "undefined_object",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a slender, swaying pole to be in contact with a rugged log, especially if they are both parts of a larger structure or in close proximity. The 'touching' spatial relationship fits the described context.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "Both subject and object are described as upright vertical poles. It is implausible for one pole to be physically 'under' the other in this context, unless one is laying flat or mounted, which is not indicated. The relationship lacks enough evidence and is likely not meaningful here.",
      "label": "redundant_or_inconclusive",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name, attributes, actions, or description, making it impossible to validly assess or keep the spatial 'right of' relationship.",
      "label": "uninformative_object",
      "object_id": 37,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pole to be spatially to the right of a tarp, given their described positions and attributes. No physical or semantic issues are evident in the relationship.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "right of",
      "relation_type": "spatial",
      "subject_id": 6
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log to be left of another in a scene. The spatial 'left of' relationship makes sense given the subject and object descriptions, and there is no contradictory information.",
      "label": "reasonable",
      "object_id": 8,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The spatial relation 'log in front of block' is plausible, as both are stationary objects and physical arrangement could logically allow the log to be positioned in front of the block.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for two elongated, log-like objects described as stationary or moving slowly to be touching each other, especially since both are described with similar characteristics and close proximity is implied.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a log to be under a tree, such as lying on the ground beneath the tree's canopy. The spatial 'under' relationship fits the described physical arrangement.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log to be to the left of another log, and there is nothing in the metadata that contradicts this spatial relationship.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "drop",
      "explanation": "The object is unidentified (no name or attributes), so the spatial relationship 'log under [unknown]' cannot be validated or meaningfully interpreted.",
      "label": "object_unknown",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log to be situated in front of another in a spatial arrangement, especially given the distinct attribute descriptions for each, indicating they are separate objects.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a log to be under a pole, given that both are elongated, upright, and stationary. There is no information contradicting this spatial relationship.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The 'touching' predicate in a spatial relationship between a log and an unspecified object is plausible based on the information provided. There is nothing physically or semantically implausible about these objects being in contact, even if the second object is unspecified.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a log to be left of a tarp in a scene, with nothing in the metadata contradicting this spatial relationship. Both objects are distinct and stationary, so 'left of' is a reasonable relationship.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 7
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'log (uncertain) left of block (uncertain)' is spatially plausible, as both objects have clear forms and no contradictory information in the descriptions; their relative left/right positions can be meaningfully described.",
      "label": "reasonable",
      "object_id": 9,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'left of' between two similar log-like objects is plausible and reasonable given that logs can be positioned relative to each other in a scene. No contradictions or redundancies are evident.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a log (on the ground) to be under a tree, such as resting beneath its canopy. The relationship is thus reasonable and should be kept.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "Both subject and object are similar log-like objects. The spatial predicate 'left of' is reasonable to describe their relative positions. No evidence suggests the relationship is incorrect or flipped.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'under' for a log (uncertain) as the subject and an unspecified object is plausible without explicit contradictory information. The log's upright orientation does not preclude something being above it, so it could reasonably be under another object.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log (possibly of different type or certainty, as described) to be spatially 'in front of' another log; nothing in the metadata contradicts this relationship.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "flip",
      "explanation": "Given both objects (log and pole) are described as standing upright, a log being 'under' a pole in a vertical orientation is implausible. Flipping makes more sense: it would be more reasonable for a pole to be under a log (if, for instance, the log crosses over or lies horizontally above the pole).",
      "label": "flipped",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'left of' between a log and another object is plausible, as there are no attributes or actions that contradict this arrangement.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a slender, upright log to be touching a slender tarp, as both objects can be close or adjacent, and 'touching' is a spatial predicate that fits this context.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "touching",
      "relation_type": "spatial",
      "subject_id": 8
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'block left of log' is plausible given typical arrangements and no contradictory information in the metadata.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a block to be under a tree, as trees are tall and can have objects beneath them. The spatial relationship 'under' makes sense in this context.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'left of' is spatial and plausible for two distinct physical objects, such as a block and a log, being described in a scene. There is nothing semantically or physically implausible about positioning the block to the left of the log.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "drop",
      "explanation": "The object lacks a name or description, making it impossible to assess the validity of the 'under' relationship.",
      "label": "not_evaluable",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is spatially plausible for a block to be positioned 'in front of' a log, especially given the descriptions suggesting the block is prominently featured and the log is dominant and stationary. The relationship makes sense physically and spatially.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "flip",
      "explanation": "It is more physically plausible for a pole to be under a block if the block is raised, but typically, a block would be under a pole (such as a pole standing upright on a block or surface). The current relationship as 'block under pole' is unlikely, so flipping to 'pole under block' is the correct representation.",
      "label": "flipped",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'left of' can reasonably apply between two objects even if the object lacks detailed description, as their relative positions could still be correctly annotated.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically plausible for a block to be spatially positioned to the left of a tarp. The descriptions do not indicate any issue with the orientation or location of the subject and object.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 9
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a log to be under a tree, as logs often rest on the ground below trees. The spatial relationship 'under' makes sense in this context.",
      "label": "reasonable",
      "object_id": 11,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'left of' is a spatial relationship that makes sense between two similar 'log (uncertain)' objects, regardless of their individual attributes, as long as their relative positions allow it. There is nothing physically or semantically implausible about this relationship.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "drop",
      "explanation": "The object is unspecified and lacks attributes or a description, making it impossible to judge the plausibility of the 'under' spatial relationship.",
      "label": "insufficient_information",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for one log (the slender, elongated one) to be in front of another log (the rugged, weathered one); the spatial predicate 'in front of' is reasonable in this context.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a log to be under a pole, especially given that both are elongated objects and their orientation is uncertain. The spatial 'under' relationship makes sense.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "Spatial relation 'left of' can be assessed even if the object lacks a name or description; the log being left of another object with an unknown label is plausible.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "The spatial predicate 'left of' is plausible between a log-like object and a tarp-like object; there is no indication in the metadata that contradicts this spatial arrangement.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 10
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a tree to be above a log, especially given the description that the tree is prominent and broad-canopied while the log is an uncertain, possibly lower object. The spatial relationship 'above' fits this scene context.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship has no name, attributes, or description, making it impossible to evaluate the plausibility of the 'beside' relationship.",
      "label": "missing_object_info",
      "object_id": 19,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible for a tree to be above a log, as a tree is typically vertical and logs are often found at or near ground level beneath or next to trees.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and common for a tree to be beside a pole, and nothing about the attributes or actions makes the relationship questionable.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "drop",
      "explanation": "The object in the relationship has no name or description, making it impossible to assess the plausibility of the 'above' predicate between the subject and object.",
      "label": "missing_object",
      "object_id": 37,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a tall tree to be above a lightweight tarp in an outdoor scene, especially if the tree is standing and the tarp is lower or on the ground.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 11
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'log (uncertain) under [unknown object]' is plausible as the log is described as upright and a typical use of 'under' in spatial terms is reasonable, even though the second object's identity is missing.",
      "label": "reasonable",
      "object_id": 19,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for one log to be described as being in front of another log, especially given their distinct descriptions. The spatial predicate 'in front of' makes sense here.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "Given both the log and the pole are described as upright and elongated, it is plausible for the log to be under the pole in terms of spatial arrangement, such as the log standing beneath or at the base of the pole.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "under",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "The 'left of' spatial relationship is plausible, even though the object is not described. In scene graphs, 'left of' describes a straightforward spatial arrangement; lacking object detail does not negate possible relative location.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "The spatial relationship 'log (uncertain) left of tarp (uncertain)' is plausible, as both objects can be positioned relative to each other in a scene. There is nothing physically or semantically impossible about this arrangement.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 12
    },
    {
      "decision": "keep",
      "explanation": "The relationship asserts that an unspecified subject (object 19) is above a log, which is plausible as many things could be spatially located above a log in a scene.",
      "label": "reasonable",
      "object_id": 35,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for an unspecified object (subject) to be beside a stationary pole; 'beside' is a spatial relation that does not require particular object identities or actions.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'above' is a general spatial relation that is plausible between two unspecified objects; with no context indicating implausibility, it is reasonable to keep.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "It is plausible that an unspecified object (subject) is located above a tarp, given the spatial predicate 'above' and the described context of a dynamic, flexible tarp. No physical rules are violated.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "above",
      "relation_type": "spatial",
      "subject_id": 19
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a log and a pole to be beside each other in a scene, especially as both are described as stationary and there is no indication that their relative positions would make 'beside' semantically or physically incorrect.",
      "label": "reasonable",
      "object_id": 36,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 35
    },
    {
      "decision": "drop",
      "explanation": "The object of the relationship lacks a name or description, making it impossible to evaluate the spatial relationship 'in front of' for plausibility.",
      "label": "unknown_object",
      "object_id": 37,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 35
    },
    {
      "decision": "keep",
      "explanation": "It is reasonable for a log to be described as 'in front of' a tarp in a video scene, as logs and tarps can plausibly be positioned this way in space without any physical contradiction.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "in front of",
      "relation_type": "spatial",
      "subject_id": 35
    },
    {
      "decision": "keep",
      "explanation": "The 'beside' spatial relationship is plausible between a pole and another unspecified object; physical proximity does not require further semantic detail.",
      "label": "reasonable",
      "object_id": 37,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 36
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a pole and a tarp to be beside each other, given their described properties and spatial relationship. The predicate 'beside' fits the scene, so the relationship should be kept.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "beside",
      "relation_type": "spatial",
      "subject_id": 36
    },
    {
      "decision": "keep",
      "explanation": "The 'left of' spatial relationship between an unspecified subject and a vertically striped tarp is plausible. Nothing in the metadata contradicts this arrangement, so the relationship can be kept.",
      "label": "reasonable",
      "object_id": 39,
      "predicate": "left of",
      "relation_type": "spatial",
      "subject_id": 37
    },
    {
      "decision": "keep",
      "explanation": "It is semantically and physically reasonable for a camera to focus on a rooster in a video scene, and the predicate 'camera focusing on' fits well with the provided subject and object roles.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "The relationship 'camera panning away from rooster' is semantically valid, as video scenes commonly describe camera actions relative to visible objects. The rooster being the object from which the camera pans makes sense.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "camera panning away from",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "A camera can pan towards an object, making 'camera panning toward' a logically sound relationship even if the object identities are not specified here.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "camera panning toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "drop",
      "explanation": "Both subject and object are undefined, so the relationship cannot be evaluated or considered valid.",
      "label": "missing_subject_object",
      "object_id": 1,
      "predicate": "camera focusing on",
      "relation_type": "attentional",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "The predicate 'camera panning back toward' commonly uses an implicit camera as the subject (here represented as null/-1), focusing on the rooster as the object. This relationship is sensible and correctly reflects a typical videographic motion description.",
      "label": "reasonable",
      "object_id": 2,
      "predicate": "camera panning back toward",
      "relation_type": "motion",
      "subject_id": -1
    },
    {
      "decision": "keep",
      "explanation": "It is physically and semantically plausible for a rooster to be perching on a log, given both entities' descriptions and the functional predicate.",
      "label": "reasonable",
      "object_id": 3,
      "predicate": "perching on",
      "relation_type": "functional",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "A rooster standing on a log is a plausible and common scenario; the rooster is the active agent and the log is the surface.",
      "label": "reasonable",
      "object_id": 5,
      "predicate": "standing on",
      "relation_type": "functional",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and semantically correct for a rooster to be standing on a log, as this is a common behavior for birds and matches the context provided.",
      "label": "reasonable",
      "object_id": 7,
      "predicate": "standing on",
      "relation_type": "functional",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is physically plausible and common for a rooster to be standing on a log. The relationship fits the context of the described scene and the objects involved.",
      "label": "reasonable",
      "object_id": 10,
      "predicate": "standing on",
      "relation_type": "functional",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "It is plausible and semantically appropriate for a rooster to be standing near a log (even if the identity of the log is uncertain). No physical or logical errors present.",
      "label": "reasonable",
      "object_id": 12,
      "predicate": "standing near",
      "relation_type": "functional",
      "subject_id": 2
    },
    {
      "decision": "keep",
      "explanation": "A rooster can plausibly be 'being held by' another (unidentified) object, such as a person. The directionality is correct for this predicate; the subject is being acted upon.",
      "label": "reasonable",
      "object_id": 1,
      "predicate": "being held by",
      "relation_type": "functional",
      "subject_id": 2
    },
    {
      "decision": "drop",
      "explanation": "The subject lacks a name or description, making it impossible to assess whether it can plausibly hold a rooster or if the relationship is valid.",
      "label": "insufficient_subject_info",
      "object_id": 2,
      "predicate": "holding",
      "relation_type": "functional",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The subject lacks a name or description, making it impossible to determine if it can plausibly 'look at' the rooster.",
      "label": "unknown_subject",
      "object_id": 2,
      "predicate": "looking at",
      "relation_type": "attentional",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "The subject lacks a name, description, or attributes, making it impossible to assess the relationship's plausibility or meaning.",
      "label": "insufficient_subject_info",
      "object_id": 2,
      "predicate": "interacting with",
      "relation_type": "higher_order",
      "subject_id": 1
    },
    {
      "decision": "drop",
      "explanation": "It is implausible for a plant to be 'walking through' something, as plants are stationary and do not exhibit this type of motion. The predicate is not appropriate for the plant as the subject.",
      "label": "physically_impossible",
      "object_id": 17,
      "predicate": "walking through",
      "relation_type": "motion",
      "subject_id": 1
    },
    {
      "decision": "keep",
      "explanation": "It is plausible for a subject (even if unnamed) to be foraging near a plant, especially given the described presence of a lush, prominent plant in the scene. The relationship is semantically sound.",
      "label": "reasonable",
      "object_id": 17,
      "predicate": "foraging near",
      "relation_type": "higher_order",
      "subject_id": 1
    }
  ],
  "relationships": [
    [
      2,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      2,
      37,
      "in front of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      3,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      3,
      36,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      3,
      37,
      "touching",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      4,
      19,
      "in front of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      4,
      37,
      "left of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      5,
      11,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      5,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      5,
      36,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      6,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      6,
      36,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      6,
      37,
      "right of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      7,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      9,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      10,
      19,
      "under",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      11,
      19,
      "beside",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      11,
      37,
      "above",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      35,
      37,
      "in front of",
      [
        [
          0,
          72
        ]
      ],
      "spatial"
    ],
    [
      -1,
      1,
      "camera focusing on",
      [
        [
          144,
          168
        ]
      ],
      "attentional"
    ],
    [
      1,
      2,
      "holding",
      [
        [
          144,
          168
        ]
      ],
      "functional"
    ],
    [
      1,
      2,
      "looking at",
      [
        [
          144,
          168
        ]
      ],
      "attentional"
    ],
    [
      1,
      2,
      "interacting with",
      [
        [
          144,
          168
        ]
      ],
      "higher_order"
    ],
    [
      1,
      17,
      "walking through",
      [
        [
          144,
          168
        ]
      ],
      "motion"
    ]
  ],
  "video_id": "sav_000016",
  "drop_relationships_only": true,
  "drop_relationships_missing_spans": []
}